{

    "_meta": {
		"sources": [
			{
				"json": "BB5E",
				"abbreviation": "BB5E",
				"full": "Black Books: Guide to Therion",
				"authors": [
					"Gibson1027 "
				],
				"convertedBy": [
					"Gibson1027"
				],
				"version": "1.0.0",
				"url": "",
				"targetSchema": "1.0.0",
				"color": "e180ff"
			}
		],
		"dateAdded": 1647370398,
		"dateLastModified": 1647370398
	},
    "subclass": [
        {
			"name": "College of the Battlesong", 
			"source": "BB5E",
			"className": "Bard",
			"classSource": "PHB",
			"shortName": "Battlesong",
			"subclassFeatures": [
				"BattleSong Readiness|Bard|PHB|Battlesong|BB5E|3",
				"Dirge of Doom|Bard|PHB|Battlesong|BB5E|3",
				"Heroic Boast|Bard|PHB|BattleSong|BB5E|6",
				"If I Can Do It, So Can You|Bard|PHB|Battlesong|BB5E|6",
				"Cower, Villein! Thy End is Nigh!|Bard|PHB|Battlesong|BB5E|6",
				"Bolstering Roast|Bard|PHB|Battlesong|BB5E|14"
			]
		},
        {
			"name": "Flame Hammer Domain",
			"source": "BB5E",
			"className": "Cleric",
			"classSource": "PHB",
			"shortName": "Flame Hammer",
			"subclassSpells": [
				"Armor of Agathys",
				"Thunder Wave",
				"Heat Metal",
				"Scorching Ray",
				"Fireball",
				"Pulse Wave|egw",
				"Fire Shield",
				"Wall of Fire",
				"Destructive Wave",
				"Steel Wind Strike|xge"
			],
			"subclassFeatures": [
                "Bonus Proficiencies|Cleric|PHB|Flame Hammer|BB5E|1",
				"Channel Divinity: Shield of the Forgemaster|Cleric|PHB|Flame Hammer|BB5E|2",
				"Fanning the Flames|Cleric|PHB|Flame Hammer|BB5E|6",
                "Channel Divinity: Blade of the Forgemaster|Cleric|PHB|Flame Hammer|BB5E|6",
				"Divine Strike|Cleric|PHB|Flame Hammer|BB5E|8",
				"True Forge Lord|Cleric|PHB|Flame Hammer|BB5E|17"
			]
		},
        {
			"name": "Circle of the Woe Warden",
			"source": "BB5E",
			"className": "Druid",
			"classSource": "PHB",
			"shortName": "Woe",
			"subclassFeatures": [
				"Primordial Panoply|Druid|PHB|Woe|BB5E|2",
				"Grove of Woe|Druid|PHB|Woe|BB5E|2",
				"Extra Attack|Druid|PHB|Woe|BB5E|6",
				"Greater Grove|Druid|PHB|Woe|BB5E|10",
				"Steelbark & Spiterazor|Druid|PHB|Woe|BB5E|14"
			]
		},
        {
			"name": "Oath of the Gallant Crusader",
			"source": "BB5E",
			"className": "Paladin",
			"classSource": "PHB",
			"shortName": "Gallant",
			"subclassSpells": [
				"Absorb Elements|xge",
				"Shield",
				"Immovable Object|egw",
				"Spiritual Weapon",
				"Haste",
				"Protection from Energy",
				"Guardian of Faith",
				"Otiluke's Resilient Sphere",
				"Hold Monster",
				"Wall of Light|xge"
			],
			"subclassFeatures": [
				"Oath Spells|Paladin|PHB|Gallant|BB5E|3",
				"Channel Divinity: Crusader’s Challenge|Paladin|PHB|Gallant|BB5E|3",
				"Channel Divinity: Blessed Arcs|Paladin|PHB|Gallant|BB5E|3",
				"Oath Proficiencies|Paladin|PHB|Gallant|BB5E|3",
				"Aura of the Holy Bulwark|Paladin|PHB|Gallant|BB5E|7",
				"Immovable Object|Paladin|PHB|Gallant|BB5E|15",
				"Unstoppable Force|Paladin|PHB|Gallant|BB5E|20"
			]
		},
        {
			"name": "Fragment of Divinity",
			"source": "BB5E",
			"className": "Warlock",
			"classSource": "PHB",
			"shortName": "Fragment",
			"subclassSpells": [
				"Command",
				"Gift of Alacrity",
				"Enhance Ability",
				"Enlarge Reduce",
				"Conjure Barrage",
				"Sending",
                "Polymorph",
				"Gravity Sinkhole",
				"Creation",
				"Geas"
			],
			"subclassFeatures": [
				"Expanded Spell List|Warlock|PHB|Fragment|BB5E|1",
				"A Piece of the Gods|Warlock|PHB|Fragment|BB5E|1",
				"Manifest Soul|Warlock|PHB|Fragment|BB5E|1",
				"Unarmored Defense|Warlock|PHB|Fragment|BB5E|1",
				"Imposing Splendor|Warlock|PHB|Fragment|BB5E|1",
				"Battle Rush|Warlock|PHB|Fragment|BB5E|6",
				"Physical Manifestation|Warlock|PHB|Fragment|BB5E|10",
				"Inspiring Awe, Powerful Menace|Warlock|PHB|Fragment|BB5E|14"
			]
		} 
    ],
    "subclassFeature": [
		{
			"name": "College of the Battlesong",
			"source": "BB5E",
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Battlesong",
			"subclassSource": "BB5E",
			"level": 3,
			"entries": [
				"Votaries of the College of Battlesong are masters of blade and prose. While some feel that they need to prepare and perform for civilians, Battlesongs find their masterpieces amongst the clang of swords and blasts of cannons. This conductor of war inspires their allies and cuts down their enemies for the longer they play the more cacophonous their song of battle becomes.",
				"Battlesong bards become adventurers for the hunt of combat and the release of inspiration with the bloodletting of their enemies. They focus heavily on orchestrating combat and become more powerful with each swing of the blade and firing of the arrow.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Dirge of Doom|Bard|PHB|BattleSong|BB5E|3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "BattleSong Readiness|Bard|PHB|Battlesong|BB5E|3"
				}
			]
		},
		{
			"name": "BattleSong Readiness",
			"source": "BB5E",
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Battlesong",
			"subclassSource": "BB5E",
			"level": 3,
			"entries": [
				"At 3rd level, you have learned to perform despite the harsh, demanding conditions of the battlefield. You gain proficiency in medium armor, shields, and martial weapons."
			]
		},
		{
			"name": "Dirge of Doom",
			"source": "BB5E",
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Battlesong",
			"subclassSource": "BB5E",
			"level": 3,
			"entries": [
				"At 3rd level, as a bonus action, you may spend 1 use of Bardic Inspiration to play a Dirge of Doom for one minute. When you begin your performance, choose either attack rolls, physical saving throws, mental saving throws, or ability checks. At the start of their turn, enemies that can hear the dirge of doom must make a Charisma saving throw against your spell save DC or take a -1 penalty on the selected rolls until the start of their next turn. At the end of each of your turns thereafter, the penalty worsens by 1, to a maximum penalty of your proficiency modifier.",
				"Your Dirge of Doom ends early if you are in an area of magical silence or are otherwise unable to produce sound, such as being in a vacuum, or if you are affected by any condition that prevents you from taking an action on your turn. Maintaining the Dirge of Doom does not require any additional actions on subsequent rounds, and creatures that are deaf are unaffected by it entirely, as are creatures immune to the Frightened condition."
			]
		},
		{
			"name": "Heroic Boast",
			"source": "BB5E",
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Battlesong",
			"subclassSource": "BB5E",
			"level": 6,
			"header": 2,
			"entries": [
				"At 6th level, you have mastered the art of championing the prowess of your comrades-in-arms, proudly proclaiming their strengths to the world at large. As a bonus action, you may spend 1 use of Bardic Inspiration to grant an ally other than yourself a bonus equal to your proficiency bonus on one skill check that they already have proficiency in. This is an extended performance, and the effects last for as long as the skill check takes, up to an hour per use of Bardic Inspiration."
			]
		},
		{
			"name": "If I Can Do It, So Can You",
			"source": "BB5E",
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Battlesong",
			"subclassSource": "BB5E",
			"level": 6,
			"header": 2,
			"entries": [
				"At 6th level, you can speak up when you see someone being oppressed and harden their resolve. As a reaction, when a creature within 30 feet of you makes a saving throw against being {@condition frightened} or {@condition charmed}, you can start a performance per the Countercharm feature. The creature gains advantage on the saving throw as part of the performance."
			]
		},
		{
			"name": "Cower, Villein! Thy End is Nigh!",
			"source": "BB5E",
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Battlesong",
			"subclassSource": "BB5E",
			"level": 6,
			"header": 2,
			"entries": [
				"At 6th level, you’ve learned how to focus your Dirge of Doom, lambasting your foes with focused, targeted, and genuinely quite hurtful remarks, describing in detail how brutally your comrades will obliterate them, or other means of verbally roasting your enemies. As an action, you may choose one creature currently affected by your Dirge of Doom. That creature must make a Wisdom saving throw or be Frightened of you until they are no longer affected by your Dirge of Doom, either by making their save against the Dirge, or if the Dirge ends for any reason.",
				"This ability may affect no more than your Charisma modifier in creatures at once, as there is a limit to how many creatures you can cleverly insult in the brief span of a combat round, as impressive as your burns might be."
			]
		},
		{
			"name": "Bolstering Roast",
			"source": "BB5E",
			"className": "Bard",
			"classSource": "PHB",
			"subclassShortName": "Battlesong",
			"subclassSource": "BB5E",
			"level": 14,
			"header": 2,
			"entries": [
				"At 14th-level, you have learned to lift your companions’ morale while you tear apart the enemy’s. By specifying who in particular is going to kick the ass of whom during your Dirge of Doom, your allies’ confidence and fighting-spirit is built-up as much as your enemies’ is torn down.",
				"Allies that can hear your Dirge of Doom gain a number of temporary hit points equal to the sum of the penalties applied to all enemies by your Dirge at the start of their turn. For example, if your Dirge’s penalty is currently two, and three creatures are affected by it, your ally would gain six temporary hit points at the start of their turn.",
				"Additionally, allies that can hear your Dirge of Doom may add your current Dirge penalty to all weapon and spell damage rolls they make; this damage of a type the weapon or spell already deals."
			]
		},
		{
			"name": "Flame Hammer Domain",
			"source": "BB5E",
			"className": "Cleric",
			"classSource": "PHB",
			"subclassShortName": "Flame Hammer",
			"subclassSource": "BB5E",
			"level": 1,
			"entries": [
				"Amongst the ancient halls and great forge chambers of the Drukafaren, none revere the creations of the forge father Moradin more than clerics of the Flame Hammer. They see through the endless toil, and bountiful flame the forge father's gifts and endless blessings. Moradian teaches that, through struggle and strength, his followers may overcome any obstacle and forge their own path. Flame Hammers take this philosophy to heart as they baptize their armor and weapons in the blessed molten rivers of Mordain's forge in Dornarrvost. These imbued relics of the forge father give Flame Hammers the tools to create their own way and to overcome any that would desecrate or destroy Moradin's will. In one hand they wield the indestructible holy hammer of the dwarves while in the other, the inescapable wrath of Moradin's deific flame and molten metal.",
                "Flame Hammers become adventurers to seek out and recover ancient temples, holy sites, and relics of Moradin. Many have been lost through the ages or have fallen into the hands of those unsuited to such relics. Flame Hammers will carve a path of burning fire and molten death to reach their prize for nothing stands in the way of the blazing hammers of the forge lord.",
				{
					"type": "table",
					"caption": "Flame Hammer Domain Spells",
					"colLabels": [
						"Cleric Level",
						"Spells"
					],
					"colStyles": [
						"col-3 text-center",
						"col-9 text-left"
					],
					"rows": [
						[
							"1st",
							"{@spell armor of agathys}, {@spell thunder wave}"
						],
						[
							"3rd",
							"{@spell scorchig ray}, {@spell heat metal}"
						],
						[
							"5th",
							"{@spell fireball}, {@spell pulse wave|egw}"
						],
						[
							"7th",
							"{@spell wall of fire}, {@spell fire shield}"
						],
						[
							"9th",
							"{@spell destructive wave}, {@spell steel wind strike|xge}"
						]
					]
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Crucible Shield|Cleric|PHB|Flame Hammer|BB5E|1"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Bonus Proficiencies|Cleric|PHB|Flame Hammer|BB5E|1"
				}
			]
		},
        {
            "name": "Crucible Shield",
           "source": "BB5E",
            "className": "Cleric",
            "classSource": "PHB",
            "subclassShortName": "Flame Hammer",
            "subclassSource": "BB5E",
            "level": 1,
            "entries": [
                "At 1st level, your faith in the gods of forge and flame arm you with a buffer of wreathing flames, superheated air, or floating, gleaming embers that blunt incoming strikes and enact divine retribution on your foes.",
                "At the start of each of your turns in combat, you gain a number of temporary hit points equal to your Cleric level. These temporary hit points stack with other sources of temporary hit points, but do not stack with themselves, and unless otherwise specified, they are lost first when you take damage.",
                "When you take damage while you have the temporary hit points granted by your Crucible Shield, you may spend your reaction to deal fire damage equal to twice your Cleric level, plus your Wisdom modifier, to the creature who caused the damage, so long as that creature is within 60 feet of you.",
                "Lastly, flickering remnants of your shield can guide your strikes. Once per round while you have temporary hit points from this feature and make a melee attack with a bludgeoning melee weapon, you may use your Wisdom modifier instead of Strength for the attack and damage rolls; this is called a Crucible Strike."


            ]
        },
        {
            "name": "Bonus Proficiencies",
           "source": "BB5E",
            "className": "Cleric",
            "classSource": "PHB",
            "subclassShortName": "Flame Hammer",
            "subclassSource": "BB5E",
            "level": 1,
            "entries": [
               "At 1st level, you gain proficiency in heavy armor and all bludgeoning martial weapons.",
                "Bludgeoning martial weapons count as a holy symbol and spellcasting focus for you."
            ]
        },
        {
            "name": "Channel Divinity: Shield of the Forgemaster",
           "source": "BB5E",
            "className": "Cleric",
            "classSource": "PHB",
            "subclassShortName": "Flame Hammer",
            "subclassSource": "BB5E",
            "level": 2,
            "header": 2,
            "entries": [
               "Starting at 2nd level, you can use Channel Divinity to grant a mote of the fire of your faith to guard your allies for a moment. As a bonus action, this ability grants a number of allies up to your proficiency bonus the benefit of a Crucible Shield of their own. This grants the temporary hit points one time, and they do not refresh once consumed unless you use this ability again.",
               "Your allies may spend their reaction when damaged to deal damage to their attacker in the same way you can, using your Cleric level and Wisdom modifier to determine the amount of fire damage dealt. If your ally does not have a reaction to spend, or chooses not to spend it, you may spend your reaction on their behalf, so long as they and their attacker are both within 60 feet of you."
            ]
        },
        {
            "name": "Fanning the Flames",
           "source": "BB5E",
            "className": "Cleric",
            "classSource": "PHB",
            "subclassShortName": "Flame Hammer",
            "subclassSource": "BB5E",
            "level": 6,
            "header": 2,
            "entries": [
               "Beginning at 6th level, your power of faith fuels the flame of your Crucible Strikes. When you make a Crucible Strike, you add an additional number of fire damage dice equal to your proficiency modifier. By making Crucible Strikes consecutively, you can fan their flames to greater and greater intensity.",
               "The size of the damage dice from this ability begins at a {@dice 1d4}. Each time you successfully land a Crucible Strike on a creature, the damage dice increases by one size, to a maximum of a {@dice d8}. The damage dice do not change if you attempt a Crucible Strike and miss, and if you do not make a Crucible Strike at some point during a round, the flames wither and the die size resets to a {@dice 1d4}."
            ]
        },
		{
            "name": "Channel Divinity: Blade of the Forgemaster",
           "source": "BB5E",
            "className": "Cleric",
            "classSource": "PHB",
            "subclassShortName": "Flame Hammer",
            "subclassSource": "BB5E",
            "level": 6,
            "header": 2,
            "entries": [
               "Starting at 6th level, you can use Channel Divinity to wreath your allies’ arms in the flames of your holy crucible. As a bonus action, this ability grants a number of allies up to your proficiency bonus the benefit of your Crucible Strike’s bonus damage. The next successful melee or ranged weapon attack that they make deals as much additional fire damage as your Crucible Strike would gain that round."
            ]
        },
        {
            "name": "Divine Strike",
           "source": "BB5E",
            "className": "Cleric",
            "classSource": "PHB",
            "subclassShortName": "Flame Hammer",
            "subclassSource": "BB5E",
            "level": 8,
            "header": 2,
            "entries": [
                "At 8th level, you gain the ability to infuse your weapon strikes with the burning fury of the forge. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 fire damage to the target. When you reach 14th level, the extra damage increases to {@dice 2d8}."
            ]
        },
        {
            "name": "True Forge Lord",
           "source": "BB5E",
            "className": "Cleric",
            "classSource": "PHB",
            "subclassShortName": "Flame Hammer",
            "subclassSource": "BB5E",
            "level": 17,
            "header": 2,
            "entries": [
               "At 17th level, your blessed affinity with fire and metal reaches a point of near-absolute mastery. You gain immunity to fire damage, and while wearing heavy armor, you have resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks."
            ]
        },
		{
			"name": "Circle of the Woe Warden",
			"source": "BB5E",
			"className": "Druid",
			"classSource": "PHB",
			"subclassShortName": "Woe",
			"subclassSource": "BB5E",
			"level": 2,
			"entries": [
				"Druids of the Circle of Woe Wardens are nature's staunch defenders and terrible executioners. These primordial and cogent druids recognize that, while most living beings deserve a place in the natural cycle, creatures that corrupt and destroy the connate order must be purged for the benefit of the land itself. Woe wardens, as they are known, protect the creatures of the antediluvian woe forests by manipulating the essence of the very plants and trees to obliterate any that would cause them harm. Towering sprouting fields of razor keen vines or mighty walls of thick bark are at the command of the woe warden and their ever growing connection to nature itself.",
				"All woe warden druids hold their sacred oath as the highest of honors for nature and do not think twice about the actions they must take to defend the world they hold dear.",
				"Members of this circle become adventurers to destroy and to purge forces that threaten their lands or to seek out greater natural secrets hidden in the plants of the land. Wherever these druids go, all that dare to corrupt or destroy Therion will cower in fear for their righteous natural convictions will stop them.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Primordial Panoply|Druid|PHB|Woe|BB5E|2"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Grove of Woe|Druid|PHB|Woe|BB5E|2"
				}

			]
		},
		{
			"name": "Primordial Panoply",
			"source": "BB5E",
			"className": "Druid",
			"classSource": "PHB",
			"subclassShortName": "Woe",
			"subclassSource": "BB5E",
			"level": 2,
			"entries": [
				"At 2nd level, you learn to arm yourself with the traditional wargear of the Forests of Woe. At the end of a long rest, you may create the following for yourself:",
				"-One suit of Ironbark Armor, granting an Armor Class of 14 + Dexterity modifier (maximum 2) when worn. The base value of the Ironbark Armor increases by 1 at 6th, 10th, and 14th level.",
				"-One Ironbark Shield, granting a +2 to bonus to Armor Class when worn;",
				"-Up to two Razorkeen Weapons, taking the shape of a Halberd or any other melee weapon in the Druid weapon proficiency list.",
				"You are considered proficient with your Primordial Panoply. Additionally, your Razorkeen Weapons count as magical, and you may use your spell attack modifier when making melee attacks with them.",
				"The damage dice of your Razorkeen Weapons increases by one at 10th and 14th level. These additional damage dice are not multiplied on a critical hit."
			]
		},
		{
			"name": "Grove of Woe",
			"source": "BB5E",
			"className": "Druid",
			"classSource": "PHB",
			"subclassShortName": "Woe",
			"subclassSource": "BB5E",
			"level": 2,
			"entries": [
				"Starting at 2nd level, you learn the Woe Warden’s signature ability, becoming a living conduit for the natural cycle of life, death, and rebirth. As a bonus action, you can magically conjure a 20’ radius of violent, entangling undergrowth around yourself for one minute; the radius remains centered on you, moving as you do. ",
				"The gnarled roots and thorny vines of the Grove of Woe cause the affected area to count as difficult terrain for enemies, including enemies not touching the ground, as the lashing tendrils grasp and inhibit them as well as they do opponents standing on solid earth. Additionally, the Grove of Woe causes one additional effect from the following list, chosen when the Grove is conjured:",
				
				{
					"type": "list",
					"style": "list-hang-notitle",
					"items": [
						{
							"type": "item",
							"name": "tanglegrove",
							"entry": "Enemies that start their turn in the affected area must make a Dexterity saving throw against your spell save DC or be Grappled until they make a successful Strength (Athletics) check against the same DC as an Action, or until the end of your next turn, whichever comes first."
						},
						{
							"type": "item",
							"name": "Thorgrove",
							"entry": "nemies that move into the affected area take 1d4 points of magical piercing damage per square they enter. Forced movement, such as Shove attacks or the Thorn Whip cantrip, cause damage normally, in a similar manner to the Spike Growth spell."
						},
						{
							"type": "item",
							"name": "Venomgrove",
							"entry": "Enemies that start their turn in the affected area must make a Constitution saving throw or be Poisoned until the end of your next turn."
						}
					]
				},
				
				"Enemies that are immune to difficult terrain are immune to the other effects of the Grove of Woe. The Grove counts as a spell effect of the highest-level spell slot you possess for the purposes of dispelling, though it cannot be counterspelled.",
				"You can conjure your Grove of Woe a number of times equal to your Wisdom modifier, regaining all expended uses after a long rest."
			]
		},
		{
			"name": "Extra Attack",
			"source": "BB5E",
			"className": "Druid",
			"classSource": "PHB",
			"subclassShortName": "Woe",
			"subclassSource": "BB5E",
			"level": 6,
			"header": 2,
			"entries": [
				"Beginning at 6th level, you can attack twice, instead of once, whenever you take the Attack action on your turn, so long as those attacks are made with your Primordial Panoply."
			]
		},
		{
			"name": "Greater Grove",
			"source": "BB5E",
			"className": "Druid",
			"classSource": "PHB",
			"subclassShortName": "Woe",
			"subclassSource": "BB5E",
			"level": 10,
			"header": 2,
			"entries": [
				"At 10th level, the radius of your Grove of Woe increases to 30 feet. Additionally, each of the options for your Grove’s added effect is improved as follows:",
				{
					"type": "list",
					"style": "list-hang-notitle",
					"items": [
						{
							"type": "item",
							"name": "tanglegrove",
							"entry": "Enemies are Restrained, instead of Grappled."
						},
						{
							"type": "item",
							"name": "Thorgrove",
							"entry": "The damage is multiplied by your Proficiency Bonus, but no longer stacks with the Spike Growth spell."
						},
						{
							"type": "item",
							"name": "Venomgrove",
							"entry": "Creatures that fail their saving throw are Poisoned for one minute instead."
						}
					]
				}
			]
		},
		{
			"name": "Steelbark & Spiterazor",
			"source": "BB5E",
			"className": "Druid",
			"classSource": "PHB",
			"subclassShortName": "Woe",
			"subclassSource": "BB5E",
			"level": 14,
			"header": 2,
			"entries": [
				"At 14th level, your Razorkeen weapons count as silver, and your Ironbark Armor functions similarly to Adamantine, rendering you immune to critical hits while worn. Additionally, if a creature hit by your Razorkeen weapons is vulnerable to, or possesses a Regeneration feature that is overcome by, a particular damage type, the extra damage dice gained at 10th and 14th level count as that damage type for those purposes."
			]
		},
		{
			"name": "Oath of the Gallant Crusader",
			"source": "BB5E",
			"className": "Paladin",
			"classSource": "PHB",
			"subclassShortName": "Gallant",
			"subclassSource": "BB5E",
			"level": 3,
			"entries": [
				"The Oath of Protection calls to paladins whose burning drive is to shield the weak and defend the just. For these paladins, their lives and strength are a bulwark against the forces of evil and they will do all within their power to harbor those they care about. Most do this through the monolithic strength that is imbued to them by a blessed tower shield. These defenses are akin to a moving wall and are able to stand against even the strongest of strikes and mightiest of barrages. From behind their great bastions, Oath of Protection paladins summon forth great floating spiritual chains to help them defend against foes as they take on the brunt of danger.",
				"The tenets of the Oath of the Gallant Crusader vary by knightly order and from one paladin to another, but all tend to follow a consistent set of just principles similar to the following. These are guiding principles, not harsh strictures, and as long as the Gallant Crusader knows in their heart that they have made the best choice available to them, they can hold their head high with their honor intact.",
				{
					"type": "list",
					"style": "list-hang-notitle",
					"items": [
						{
							"type": "item",
							"name": "Evil Shall Know My Name:",
							"entry": "A righteous warrior’s reputation as keen a blade as the one he wields. When practical, a Gallant Crusader should introduce themselves to friend and foe alike, not out of a sense of pride, but to spread fear of their name among the ranks of the wicked."
						},
						{
							"type": "item",
							"name": "Justice, in all things:",
							"entry": "A knight’s duty is to his people, the innocent lives they have sworn to spend theirs in guardianship of, especially if they are subordinates, serfs, servants, wards, or charges in the knight’s umbrella. The life and well-being of innocents, especially those in the knights’ care, must be protected, at any personal cost."
						},
						{
							"type": "item",
							"name": "To Each their Own in the Eyes of the Law:",
							"entry": "A chevalier gallant can expect to travel to foreign lands and interact with unfamiliar customs. The way of life of an unfamiliar people should be respected, and the law of the land obeyed, except if those ways or those laws are undeniably corrupt, unnecessarily cruel, or brutally oppressive."
						},
						{
							"type": "item",
							"name": "Mercy is for the Innocent",
							"entry": "The honor of a knightly crusader is paramount. Enemies should expect mercy if they yield truly, and terrible wrath should they yield falsely, as righteousness does not require one to cater to craven fools."
						},
						{
							"type": "item",
							"name": "To Each their Own in the Eyes of the Law:",
							"entry": "A chevalier gallant can expect to travel to foreign lands and interact with unfamiliar customs. The way of life of an unfamiliar people should be respected, and the law of the land obeyed, except if those ways or those laws are undeniably corrupt, unnecessarily cruel, or brutally oppressive."
						},
						{
							"type": "item",
							"name": "Inevitability of Righteousness:",
							"entry": "Gallant crusaders are often on journeys of their own, pilgrimages or sabbaticals in search of a divine artifact or a quest of self-discovery and deepening of their faith. An honorable knight must always perform what righteous acts they are able in their journeys, but must not expect to solve every problem, in every place, at every scale; it is a crusader’s right to choose what hill to die upon, and cannot be expected to attempt an unwinnable battle unless they choose to."
						}
					]
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Oath Spells|Paladin|PHB|Gallant|BB5E|3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": 	"Channel Divinity: Crusader’s Challenge|Paladin|PHB|Gallant|BB5E|3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Channel Divinity: Blessed Arcs|Paladin|PHB|Gallant|BB5E|3"
				}
			]
		}, 
		{
			"name": "Oath Spells",
			"source": "BB5E",
			"className": "Paladin",
			"classSource": "PHB",
			"subclassShortName": "Gallant",
			"subclassSource": "BB5E",
			"level": 3,
			"entries": [
				"You gain Oath Spells at the paladin levels listed.",
				{
					"type": "table",
					"caption": "Oath of the Gallant Crusader Spells",
					"colLabels": [
						"Paladin Level",
						"Spells"
					],
					"colStyles": [
						"col-3 text-center",
						"col-9 text-left"
					],					
					"rows": [
						[
							"3rd",
							"{@spell absorb elements|xge}, {@spell shield}"
						],
						[
							"5th",
							"{@spell immovable object|egw}, {@spell spirtual weapon}"
						],
						[
							"9th",
							"{@spell haste}, {@spell protection from energy}"
						],
						[
							"13th",
							"{@spell guardian of faith}, {@spell otiluke's resilient sphere}"
						],
						[
							"17th",
							"{@spell hold monster}, {@spell wall of light|xge}"
						]
					]
				}
			]
		},
		{
			"name": "Channel Divinity: Crusader’s Challenge",
			"source": "BB5E",
			"className": "Paladin",
			"classSource": "PHB",
			"subclassShortName": "Gallant",
			"subclassSource": "BB5E",
			"level": 3,
			"entries": [
				"At 3rd level as a bonus action, you can use your Channel Divinity to present your arms and declare a righteous challenge to all who stand against you in battle. All enemies that can see you when you make your challenge must make a Wisdom saving throw. Enemies that fail have disadvantage on attack rolls against allied creatures other than you. The effects of your Crusader’s Challenge last for one minute, or until you are rendered unconscious."
			]
		},
		{
			"name": "Channel Divinity: Blessed Arcs",
			"source": "BB5E",
			"className": "Paladin",
			"classSource": "PHB",
			"subclassShortName": "Gallant",
			"subclassSource": "BB5E",
			"level": 3,
			"entries": [
				"At 3rd level as a bonus action, you can use your Channel Divinity to empower your strikes and bring the full brunt of your righteous might to bear against your foes. Your attacks deal their minimum damage to all enemy creatures within your threatened area when you make the attack, and if you successfully hit a creature with an attack during this effect, it takes additional damage equal to the minimum damage roll of that attack as well. This effect includes all additional damage from spells, divine smites, weapon enchantments, or other sources. The effect of Blessed Arcs lasts for one minute, or until you are rendered unconscious."
			]
		},
		{
			"name": "Oath Proficiencies",
			"source": "BB5E",
			"className": "Paladin",
			"classSource": "PHB",
			"subclassShortName": "Gallant",
			"subclassSource": "BB5E",
			"level": 3,
			"entries": [
				"You gain proficiency with tower shields and the {@skill Medicine} skill."
			]
		},
		{
			"name": "Aura of the Holy Bulwark",
			"source": "BB5E",
			"className": "Paladin",
			"classSource": "PHB",
			"subclassShortName": "Gallant",
			"subclassSource": "BB5E",
			"level": 7,
			"header": 2,
			"entries": [
				"At 7th level, your devotion to protecting your comrades-in-arms and the innocents in your care manifests as golden threads, chains, or other restraints upon your foes. You gain an aura. You may use your reaction when an enemy enters, moves through, or leaves the radius of your aura to attempt to halt them in place. Make an Athletics (Strength) or Athletics (Charisma) check to Shove the target, knocking them prone on a success and additionally reducing their speed to 0 until the start of your next turn.",
				"The radius of your Aura of the Holy Bulward is 10 feet, increasing to 30 feet at 18th level."
			]
		},
		{
			"name": "Immovable Object",
			"source": "BB5E",
			"className": "Paladin",
			"classSource": "PHB",
			"subclassShortName": "Gallant",
			"subclassSource": "BB5E",
			"level": 15,
			"header": 2,
			"entries": [
				"At 15th level, your steely resolve and trained stance make you an indomitable rock on the battlefield. You can no longer be knocked prone or forced to move against your will."
			]
		},
		{
			"name": "Unstoppable Force",
			"source": "BB5E",
			"className": "Paladin",
			"classSource": "PHB",
			"subclassShortName": "Gallant",
			"subclassSource": "BB5E",
			"level": 20,
			"header": 2,
			"entries": [
				"At 20th level, your righteous fervor in defense of those you care about can manifest as the divine right to spite death. As an action, once per long rest, you may enter a state of divine spite for one minute. While in this state, as long as one ally or creature you consider innocent or otherwise in your care is alive that you can see or hear, you may make a Constitution saving throw when you reach zero hit points to remain conscious with one hit point instead. The DC of this Constitution saving throw starts at 10 and increases by 2 each time you attempt one."
			]
		},
        {
			"name": "Fragment of Divinity",
			"source": "BB5E",
			"className": "Warlock",
			"classSource": "PHB",
			"subclassShortName": "Fragment",
			"subclassSource": "BB5E",
			"level": 1,
			"entries": [

				"Your path is one that will be heralded by the songs of ancients and gods alike. You have stumbled across a fragment of divinity and absorbed its very essence into your own being. The changes to come of such a radical choice are unknown as only one other, the god-king of humankind Zarus, has done such a feat. As you feel your power grow your own deific aura presents itself as your own guardian and champion. Those who draw too near are enraptured by your radiance and are crushed by the force of your godly being. In return for such powers, you feel your mortal mind slipping away thus making this transition to godhood a war of attrition against yourself. ",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Expanded Spell List|Warlock|PHB|Fragment|BB5E|1"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "A Piece of the Gods|Warlock|PHB|Fragment|BB5E|1"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Manifest Soul|Warlock|PHB|Fragment|BB5E|1"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Unarmored Defense|Warlock|PHB|Fragment|BB5E|1"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Imposing Splendor|Warlock|PHB|Fragment|BB5E|1"
				}
			]
		},
		{
			"name": "Expanded Spell List",
			"source": "BB5E",
			"className": "Warlock",
			"classSource": "PHB",
			"subclassShortName": "Fragment",
			"subclassSource": "BB5E",
			"level": 1,
			"entries": [
				"The Fragment lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you.",
				{
					"type": "table",
					"caption": "Fanbase Expanded Spells",
					"colLabels": [
						"Spell Level",
						"Spells"
					],
					"colStyles": [
						"col-3 text-center",
						"col-9 text-left"
					],
					"rows": [
						[
							"1st",
							"{@spell command}, {@spell gift of alacrity|egw}"
						],
						[
							"2nd",
							"{@spell enlarge/reduce}, {@spell enhance ability}"
						],
						[
							"3rd",
							"{@spell conjure barrage}, {@spell sending}"
						],
						[
							"4th",
							"{@spell gravity sinkhole|egw, {@spell polymorph}"
						],
						[
							"5th",
							"{@spell creation}, {@spell geas}"
						]
					]
				}
			]
		},
		{
			"name": "A Piece of the Gods",
			"source": "BB5E",
			"className": "Warlock",
			"classSource": "PHB",
			"subclassShortName": "Fragment",
			"subclassSource": "BB5E",
			"level": 1,
			"entries": [
				"You possess a Fragment of Divinity, a small object of negligible weight that you must keep on or in your person at all times; if you lose it, you lose the benefits of this patron after a number of days equal to your warlock level, though they return immediately when the Fragment is returned.",
				"You always know the direction of the shortest path to your Fragment of Divinity."
			]
		},
		{
			"name": "Manifest Soul",
			"source": "BB5E",
			"className": "Warlock",
			"classSource": "PHB",
			"subclassShortName": "Fragment",
			"subclassSource": "BB5E",
			"level": 1,
			"entries": [
				"Your Fragment of Divinity grants you the power to project the power of your soul, applying the force of your tiny mote of deific power to influence the world in your immediate vicinity and granting awareness of other carriers of similar fragments.",
				"You can tell at a glance if another creature possesses a Fragment of Divinity, and can see their Manifest Soul, if they have one.",
				"You have a Manifest Soul. Your Manifest Soul is an invisible, humanoid-shaped intangible force that you project no further than 30 feet from you at a time. Your Manifest Soul allows you to choose to originate your spells from any space within 30 feet of you, and augments your spell attacks in a unique way.",
				"The Manifest Soul allows you to make ranged spell attacks as melee spell attacks instead, so long as the target is within 30 feet of you. If the spell deals damage, you may add your Constitution modifier to the damage rolls when casting the spell through your Manifest Soul in this way."
			]
		},
		{
			"name": "Unarmored Defense",
			"source": "BB5E",
			"className": "Warlock",
			"classSource": "PHB",
			"subclassShortName": "Fragment",
			"subclassSource": "BB5E",
			"level": 1,
			"entries": [
				"As long as you wear no armor and do not use a shield, you can choose for your Armor Class to be 10 + your Charisma modifier + your Constitution modifier."
			]
		},
		{
			"name": "Imposing Splendor",
			"source": "BB5E",
			"className": "Warlock",
			"classSource": "PHB",
			"subclassShortName": "Fragment",
			"subclassSource": "BB5E",
			"level": 1,
			"entries": [
				"At 1st level, as a bonus action, you can present a pose displaying the majestic splendor of your ascended figure. So long as you benefit from the unarmored defense, this pose increases your AC by 2 until you move."
			]
		},
		{
			"name": "Battle Rush",
			"source": "BB5E",
			"className": "Warlock",
			"classSource": "PHB",
			"subclassShortName": "Fragment",
			"subclassSource": "BB5E",
			"level": 6,
			"header": 2,
			"entries": [
				"Beginning at 6th level, you gain the Eldritch Blast cantrip if you do not already have it. When you use the Eldritch Blast cantrip through your Manifest Soul, the spell produces one more beam than normal, as long as you are not in an area of magical silence or otherwise unable to speak  and, thus, can let out a valiant cry with every strike."
			]
		},
		{
			"name": "Physical Manifestation",
			"source": "BB5E",
			"className": "Warlock",
			"classSource": "PHB",
			"subclassShortName": "Fragment",
			"subclassSource": "BB5E",
			"level": 10,
			"header": 2,
			"entries": [
				"At 10th level, your Manifest Soul can take physical actions on your behalf, allowing you to make attacks with weapons, manipulate objects, shove or grapple, or any other task you could accomplish yourself, within 30 feet of you. The Manifest Soul uses your Charisma score instead of Strength for these purposes.",
				"You are treated as carrying any objects the Manifest Soul carries for the purposes of determining whether or not you are encumbered. The Manifest Soul shares your current effective size for determining whether or not it can attempt to shove or grapple a creature.",
				"The Manifest Soul can grant you or any other ally within 30 feet of you a fly speed of 60 feet, so long as they do not move more than 30 feet from you; activating this ability does not require an action, but no more than one creature may benefit from it per round."
			]
		},
		{
			"name": "Inspiring Awe, Powerful Menace",
			"source": "BB5E",
			"className": "Warlock",
			"classSource": "PHB",
			"subclassShortName": "Fragment",
			"subclassSource": "BB5E",
			"level": 14,
			"header": 2,
			"entries": [
				"At 14th level, when you use your Imposing Splendor to improve your armor class, allies within 30 feet of you gain the bonus as well.",
				"Each turn that you spend your bonus action to pose, enemies that can see you or that can see your Manifest Soul must make a Wisdom saving throwagainst your spell save DC or be Frightened until the start of your next turn. "
			]
		}
    ],

"itemProperty": [
	{
		"abbreviation": "FA",
		"source": "BB5E",
		"page": 2,
		"entries": [
			{
				"type": "entries",
				"name": "Firearm.",
				"entries": [
					"The firearm property functions as the {@b {@i Ammunition}} and {@b {@i Loading}} properties, except that you can forego one attack or use a bonus action to reload it in order to fire it again on the same turn. Reloading a firearm requires two hands unless otherwise specified.",
					"Any blacksmith could conceivably build, alter, or repair a firearm if given the designs or a specimen to copy."
				]
			}
		]
	},
	{
		"abbreviation": "SP",
		"source": "BB5E",
		"page": 0,
		"entries": [
			{
				"type": "entries",
				"name": "Spread.",
				"entries": [
					"When attacking a target within half this weapon's normal range, roll an additional damage die and add it to the weapon's damage. When fired at long range, you may apply the attack roll to an additional creature within 5 feet of the target. Roll damage against the secondary target separately."
				]
			}
		]
	},
	{
		"abbreviation": "GB",
		"source": "BB5E",
		"page": 0,
		"entries": [
			{
				"type": "entries",
				"name": "Gun Blade",
				"entries": [
					"As an action or bonus action you may attack a creature with the weapons secondary attack, usually a bayonet or saw, as if it were a standard melee weapon."
				]
			}
		]
	},
	{
		"abbreviation": "DWRF",
		"source": "BB5E",
		"page": 0,
		"entries": [
			{
				"type": "entries",
				"name": "Dwarven",
				"entries": [
					"Weapons with this property require a creature to have a dwarven racial specific trait or take the Dwarven Weapon Training feat to use."
				]
			}
		]
	},
	{
		"abbreviation": "GITH",
		"source": "BB5E",
		"page": 0,
		"entries": [
			{
				"type": "entries",
				"name": "Gith",
				"entries": [
					"Weapons with this property require a creature to be of race: Gith or take the Gith Weapon Training feat to use."
				]
			}
		]
	},
	{
		"abbreviation": "KK",
		"source": "BB5E",
		"page": 0,
		"entries": [
			{
				"type": "entries",
				"name": "Kenku",
				"entries": [
					"Weapons with this property require a creature to be of race: Kenku or take the Kenku Weapon Training feat to use."
				]
			}
		]
	},
	{
		"abbreviation": "EX",
		"source": "EW-BB5E",
		"page": 0,
		"entries": [
			{
				"type": "entries",
				"name": "Exotic",
				"entries": [
					"No characters are proficient with exotic weapons by default. To become proficient with an exotic weapon, a character must be trained in the use of that specific weapon."
				]
			}
		]
	},
	{
		"abbreviation": "DBL",
		"source": "EW-BB5E",
		"page": 0,
		"entries": [
			{
				"type": "entries",
				"name": "Double",
				"entries": [
					"When you take the Attack action and attack with a double weapon that you're holding, you can use a bonus action to attack again with the other part of the weapon. You don't add your ability modifier to the damage of the bonus attack, unless that modifier is negative."
				]
			}
		]
	},
	{
		"abbreviation": "IC",
		"source": "EW-BB5E",
		"page": 0,
		"entries": [
			{
				"type": "entries",
				"name": "Improved Critical",
				"entries": [
					"When you score a critical hit with a weapon attack using this weapon, roll the weapon dice three times instead of twice."
				]
			}
		]
	},
	{
		"abbreviation": "HAND",
		"source": "BB5E",
		"page": 0,
		"entries": [
			{
				"type": "entries",
				"name": "Handy",
				"entries": [
					"You have advantage on attack rolls against a creature you are grappling, as well as against creatures that are grappling you."
				]
			}
		]
	},
	{
		"abbreviation": "SVG",
		"source": "BB5E",
		"page": 0,
		"entries": [
			{
				"type": "entries",
				"name": "Savage",
				"entries": [
					" Savage weapons combine speed, weight and penetration, enabling them to deal decisive blows in combat. When you roll a 19 on an attack roll, roll an additional d6. If you roll the number given in parentheses next to the weapon, or higher, you score a critical hit. If the weapon has the versatile property reduce the number in the parentheses by 1, when it is wielded in two hands. If there is no number in parentheses, no need to roll a d6, a 19 is an automatic critical hit."
				]
			}
		]
	},
	{
		"abbreviation": "SW",
		"source": "BB5E",
		"page": 0,
		"entries": [
			{
				"type": "entries",
				"name": "Shield Wrap",
				"entries": [
					"You gain a +1 to attack rolls against opponents wielding a shield."
				]
			}
		]
	},
	{
		"abbreviation": "PRY",
		"source": "BB5E",
		"page": 0,
		"entries": [
			{
				"type": "entries",
				"name": "Parry",
				"entries": [
					"When you are wielding a weapon with the parry property and a creature you can see hits you with a melee attack, you can use your reaction to add 1 to your AC for that attack, potentially causing the attack to miss you. You must have a Dexterity score of 13 or higher to take advantage of this feature, which can be used in conjunction with the Defensive Duelist feat."
				]
			}
		]
	},
	{
		"abbreviation": "RP",
		"source": "BB5E",
		"page": 0,
		"entries": [
			{
				"type": "entries",
				"name": "Riposte",
				"entries": [
					"The speed of this weapon allows you to turn defence into attack. Whenever using the parry property of your weapon causes an attack to miss you, as part of the same reaction you make make a retaliatory melee attack, using your Dexterity modifier for the attack and damage rolls."
				]
			}
		]
	},
	{
		"abbreviation": "BLD",
		"source": "BB5E",
		"page": 0,
		"entries": [
			{
				"type": "entries",
				"name": "Bleed",
				"entries": [
					"Bleeding creatures must make a Consitution save vs DC 13 at the end of their turns, or take 1d6 non-mitigatable damage. Beating DC 18 ends this condition. Multiple instances of bleeding stack (max 3). ",
					"A DC 13 Wisdom (Medicine) check or magical healing will stop the bleeding."
				]
			}
		]
	}
	
],
"item": [


    {
        "name": "Dwarven Tower Shield (weapon)",
        "type": "M",
        "weaponCategory": "Martial",
        "weight": 0,
        "rarity": "Rare",
        "dmg1": "2d4",
        "dmgType": "B",
       "source": "BB5E",
        "entries": [
            "This inhuman stone slab is enchanted with countless runes and is ordained with jewels and precious metals. It increases your armor class by 3 (this replaces the shield's normal bonus to AC.) While this shield is equipped, you have disadvantage on Dexterity (Stealth) checks, and if your Strength score is lower than 15, your speed is reduced by 10 feet as if you were wearing heavy armor.",
            "Mountain Wall: As an action you may slam your shield into the ground and 'lock down'. While in this stance the shield acts as a 5 ft. full cover wall (200 HP. 22 AC) and is resistant to all damage types. It takes an action to lift your shield out of the ground."
        
        ]
    },
	{
        "name": "Bastard Sword",
        "type": "M",
        "weapon": true,
        "weaponCategory": "Martial",
        "rarity": "none",
        "value": 35000,
        "weight": 6,
        "dmg1": "2d4",
        "dmg2": "2d6",
        "dmgType": "S",
        "property": [
            "H",
            "V"
        ],
		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "This weapon requires 15 strength to weild.",
					"Powerful: When you roll a 19 on an attack roll, roll an additional {@dice 1d6}. If the result is higher than a 3 you score a critical hit with this weapon. "
                ]
            }
        ],
        "source": "EW-BB5E"
    },
    {
        "name": "Bladed Gauntlet",
        "type": "M",
        "weapon": true,
        "weaponCategory": "exotic",
        "rarity": "none",
        "value": 3000,
        "weight": 4,
        "dmg1": "1d6",
        "dmgType": "S",
        "property": [
            "L",
            "F",
            "S"
        ],
        "entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "This weapon does not require a free hand.",
					"This weapon may be used as a monk weapon.",
					"Bleeding Fist: Once per turn you may take 1d6 non-mitigatable slashing damage to increase this weapons damage dice to {@dice 2d6} for one attack."
                ]
            }
        ],
        "source": "EW-BB5E"
    },
    {
        "name": "Bolas",
        "type": "R",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 500,
        "weight": 2,
        "dmg1": "1d4",
        "dmgType": "B",
        "property": [
            "EX",
            "L",
            "S"
        ],
        "range": "10/40",
        "source": "EW-BB5E",
        "entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "Wrap: A Medium or smaller creature hit by a bolas must succeed a DC 10 Strength saving throw or become {@condition restrained} until it is freed. A bolas has no effect on creatures that are formless, or creatures that are Large or larger. A creature can use its action to make a DC 10 Strength check, freeing itself or another creature within its reach on a success. Dealing 5 slashing damage to the bolas (AC 12) also frees the creature without harming it, ending the effect and destroying the bolas. When you use an action, bonus action, or reaction to attack with a bolas, you can make only one attack regardless of the number of attacks you can normally make."
                ]
            }
        ]
    },
    {
        "name": "Butterfly Sword",
        "type": "M",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 2000,
        "weight": 2,
        "dmg1": "1d6",
        "dmgType": "S",
        "property": [
            "EX",
            "L",
            "F",
            "S"
        ],
        "entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "This weapon can be used as a monk weapon.",
                    "A monk using deflect missiles while wielding this weapon may roll {@dice 2d6} instead of {@dice 1d10} to determine the amount of damage reduced."
                ]
            }
        ],
        "source": "EW-BB5E"
    },
    {
        "name": "Chain-and-dagger",
        "type": "M",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 500,
        "weight": 4,
        "dmg1": "1d8",
        "dmgType": "P",
        "property": [
            "EX",
            "R",
            "2H"
        ],
        "source": "EW-BB5E",
        "entries": [
            "This weapon can be used as a monk weapon.",
			"Dagger Wall: If you are weilding this weapon and successfully reduce damage to zero using deflect missile, you may make a free attack action immediately after calculating the result of deflect missle. "
        ]
    },
    {
        "name": "Chakram",
        "type": "R",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 1000,
        "weight": 2,
        "dmg1": "1d4",
        "dmgType": "S",
        "property": [
            "EX",
            "L",
            "T",
            "IC"
        ],
        "range": "30/120",
        "source": "EW-BB5E",
        "entries": [
			"This weapon can be used as a monk weapon.",
			"Mighty Critical: this weapon crits on a 19-20."  ,
			"This weapon inflicts one stack of bleeding on a successful attack",   
			"Bleeding: creatures that gain a stack of bleeding take 1d6 non-mitigatable slashing damage on the start of their turn. Beating DC 18 ends this condition. A DC 16 Wisdom (Medicine) check or magical healing will stop the bleeding.",
			"a creature can accrue multiple stacks of bleeding (max 6). Each time a stack is accrued the damage at the start of their turn is increased by one damage dice to a maximum of (6d6)."


        ]
    },
    {
        "name": "Claw Bracer",
        "type": "M",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 3000,
        "weight": 2,
        "dmg1": "1d4",
        "dmgType": "P",
        "property": [
            "EX",
            "L",
            "F",
            "S"
        ],
        "source": "EW-BB5E",

		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
					"This weapon can be used as a monk weapon.",
                    "double threat: If you successfully attack with this weapon you may roll the damage roll twice. If the attack is a critical you may roll damage four times."
                ]
            }
        ]
    },
    {
        "name": "Dire Double Flail",
        "type": "M",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 13000,
        "weight": 30,
        "dmg1": "3d6",
        "dmgType": "B",
        "property": [
            "H",
            "2H",
            "DBL",
            "SW",
            "R"
        ],
        "source": "EW-BB5E",


		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
					"this weapon requires a minimum of 18 strength to wield.",
					"Double: When you take the Attack action and attack with a double weapon that you're holding, you can use a bonus action to attack again with the other part of the weapon. You don't add your ability modifier to the damage of the bonus attack, unless that modifier is negative."


                ]
            }
        ]
    },
    {
        "name": "Double Scimitar",
        "type": "M",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 12500,
        "weight": 15,
        "dmg1": "1d6",
        "dmgType": "S",
        "property": [
            "EX",
            "2H",
            "DBL"
        ],
        "source": "EW-BB5E",		
		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
					"this weapon requires a minimum of 18 dexterity to wield.",
					"Double: When you take the Attack action and attack with a double weapon that you're holding, you can use a bonus action to attack again with the other part of the weapon. You don't add your ability modifier to the damage of the bonus attack, unless that modifier is negative."
                ]
            }
        ]
    },
    {
        "name": "Dwarven Urgrosh",
        "type": "M",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 15000,
        "weight": 12,
        "dmg1": "1d6",
		"dmg2": "1d8",
        "dmgType": "S",
        "property": [
            "H",
            "2H",
            "DBL",
            "DWRF"

        ],
        "source": "EW-BB5E",
		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
					"this weapon may only be wielded by dwarves or those with training in dwarven weaponry.",
					"Flexible damage: This weapon is both a hammer and an axe. You may choose to strike with eaither end. The axe deals {@dice 1d6} slashing damage and the hammer deals {@dice 1d8} bludgeoning."
                ]
            }
        ]
    },
    {
        "name": "Dwarven Waraxe",
        "type": "M",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 25000,
        "weight": 8,
        "dmg1": "1d10",
        "dmgType": "S",
        "property": [
            "DWRF",
            "HAND"
        ],
        "source": "EW-BB5E",
		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
					"this weapon may only be wielded by dwarves or those with training in dwarven weaponry.",
					"Mighty Critical: this weapon crits on a 19-20."
                ]
            }
        ]
    },
    {
        "name": "Elven Double Bow",
        "type": "R",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 10000,
        "weight": 3,
        "dmg1": "1d8/1d8",
        "dmgType": "P",
        "property": [
            "EX",
            "A",
            "2H",
            "DBL"
        ],
        "range": "90/360",
        "source": "EW-BB5E",
        "ammoType": "arrow|phb",
		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
					"this weapon may only be wielded by elves or those with training in elven weaponry.",
                    "Double Shot: You may fire two arrows from this bow when you make an attack. When you make an attack action you may make two seperate attacks with the secondary attack having disadvantage."
                ]
            }
        ]
    },
    {
        "name": "Fukimi-bari (mouth darts)",
        "type": "R",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 100,
        "weight": 0.1,
        "dmg1": "1",
        "dmgType": "P",
        "property": [
            "EX",
            "S"
        ],
        "entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "You have advantage on Deterity (Stealth) checks made to conceal this weapon.",
                    "Deadly Breath: When you make an attack with this weapon, you may fire three darts instead of one. Make a separate attack roll with each dart."
                ]
            }
        ],
        "range": "5/20",
        "source": "EW-BB5E"
    },
    {
        "name": "Fullblade",
        "type": "M",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 40000,
        "weight": 120,
        "dmg1": "2d8",
        "dmgType": "S",
        "property": [
            "H",
            "2H",
            "SVG"
        ],
        "source": "EW-BB5E",
		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "This weapon requires 20 Strength to wield.",
					"Power Critical: When you score a critical hit with the Fullblade you may double your Strength damage modifier, as well as the damage dice."
                ]
            }
        ]
    },
    {
        "name": "Gnome Battlepick",
        "type": "M",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 6000,
        "weight": 5,
        "dmg1": "1d6",
        "dmgType": "P",
        "property": [
            "L",
            "F",
            "IC"
        ],
        "source": "EW-BB5E",
		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "This weapon may only be wielded by a halfling or gnome or those with training in wimmelbilder weaponry.",
					"Mighty Bloody Critical: this weapon crits on a 19-20. On a successful critical hit, the target gains 2 bleed stacks.",
					"Bleeding: creatures that gain a stack of bleeding take 1d6 non-mitigatable slashing damage on the start of their turn. Beating DC 18 ends this condition. A DC 16 Wisdom (Medicine) check or magical healing will stop the bleeding.",
					"a creature can accrue multiple stacks of bleeding (max 6). Each time a stack is accrued the damage at the start of their turn is increased by one damage dice to a maximum of (6d6)."


                ]
            }
        ]
    },
    {
        "name": "Gnome Calculus",
        "type": "R",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 5000,
        "weight": 2,
        "dmg1": "Special",
        "property": [
            "A",
            "S"
        ],
        "entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
					"This weapon may only be wielded by a halfling or gnome or those with training in wimmelbilder weaponry.",
                    "Launcher: This weapon can be used to launch flasks or bottles of liquid."
                ]
            }
        ],
        "range": "50/200",
        "source": "EW-BB5E"
    },
	{
        "name": "Gnome Hooked Hammer",
        "type": "M",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 2000,
        "weight": 6,
        "dmg1": "1d8",
        "dmgType": "P",
        "property": [
            "2H",
            "DBL"
        ],
        "source": "EW-BB5E",
		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
					"This weapon may only be wielded by a halfling or gnome or those with training in wimmelbilder weaponry.",
                    "Trip: If this weapon successfully lands an attack, the creature must make a DC 13 (acrobatics) check or be knocked prone."
                ]
            }
        ]
    },
    {
        "name": "Great Crossbow",
        "type": "R",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 65000,
        "weight": 22,
        "dmg1": "1d12",
        "dmgType": "P",
        "property": [
            "A",
            "H",
            "LD",
            "2H"
        ],
        "range": "100/400",
        "source": "EW-BB5E",
        "ammoType": "crossbow bolt|phb",
		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
					"You must have 16 strength and 15 dexterity to wield this weapon",
                    "Power Blow: Creatures successfully damaged by this weapon are knocked prone and are move five feet away from you."
                ]
            }
        ]
    },
    {
        "name": "Gyrspike",
        "type": "M",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 9000,
        "weight": 20,
        "dmg1": "1d8",
        "dmgType": "B",
        "property": [
            "DBL",
            "PRY",
            "RP"
        ],
        "source": "EW-BB5E",
		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
					"This weapon may only be wielded by a halfling or gnome or those with training in wimmelbilder weaponry.",
                    "OW My Head: If you land a critical hit with this weapon the creature is stunned until they are able to roll a DC 10 (constitution) saving throw."
                ]
            }
        ]
    },
    {
        "name": "Halfling Skiprock",
        "type": "R",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 300,
        "weight": 0.25,
        "dmg1": "1d4",
        "dmgType": "B",
        "property": [
            "L",
            "T",
            "S"
        ],
        "entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
					"This weapon may only be wielded by a halfling or gnome or those with training in wimmelbilder weaponry.",
                    "Rocky: If you hit a target with this weapon, you may choose to make an attack against another target within 5 feet of the first. The attack roll has disadvantage and deals the mimimum damage for the dice rolled."
                ]
            }
        ],
        "range": "10/40",
        "source": "EW-BB5E"
    },
    {
        "name": "Harpoon Gun",
        "type": "R",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 25000,
        "weight": 10,
        "dmg1": "1d10",
        "dmgType": "P",
        "property": [
            "2H",
            "LD",
            "S"
        ],
        "entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "Yar she blows: If you hit a creature that is Large or smaller with this weapon, you can pull the creature up to 10 feet closer to you."
                ]
            }
        ],
        "range": "30/120",
        "source": "EW-BB5E"
    },
    {
        "name": "Kama",
        "type": "M",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 200,
        "weight": 2,
        "dmg1": "1d6",
        "dmgType": "S",
        "property": [
            "EX",
            "L",
            "F",
            "S"
        ],
        "entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "This weapon can be used as a monk weapon.",
                    "Ankle Slice: When you attempt to knock a target prone while holding this weapon, you have advantage on the action."
                ]
            }
        ],
        "source": "EW-BB5E"
    },
    {
        "name": "Khopesh",
        "type": "M",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 1200,
        "weight": 12,
        "dmg1": "1d8",
        "dmgType": "S",
        "property": [
            "EX",
            "S"
        ],
        "entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
					"On a successful critical hit, this weapon inflicts 3 bleed stacks.",
				    "Bleeding: creatures that gain a stack of bleeding take 1d6 non-mitigatable slashing damage on the start of their turn. Beating DC 18 ends this condition. A DC 16 Wisdom (Medicine) check or magical healing will stop the bleeding.",
					"a creature can accrue multiple stacks of bleeding (max 6). Each time a stack is accrued the damage at the start of their turn is increased by one damage dice to a maximum of (6d6)."

                ]
            }
        ],
        "source": "EW-BB5E"
    },
    {
        "name": "Mantis hook",
        "type": "M",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 1500,
        "weight": 9,
        "dmg1": "1d8",
        "dmgType": "P",
        "property": [
            "EX",
            "2H",
            "S"
        ],
        "entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "Mantis Claw:The first opportuity attack you make with this weapon each round does not use your reaction."
                ]
            }
        ],
        "source": "EW-BB5E"
    },
    {
        "name": "Mercurial Greatsword",
        "type": "M",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 50000,
        "weight": 1,
        "dmg1": "2d6",
        "dmgType": "I",
        "property": [
            "EX",
            "H",
            "2H",
            "IC"
        ],
        "source": "EW-BB5E",
		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "Liquid Form: This weapon is concealed in a tiny flask with a long neck to use as a handle. Upon opening the top of the flask a great mercurial blade errupts forth. You gain advanatge on checks to conceal this weapon in its unopened form",
					"Poison: This weapon innately deals poison damage."
                ]
            }
        ]
    },
    {
        "name": "Mercurial Longsword",
        "type": "M",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 40000,
        "weight": 6,
        "dmg1": "1d8",
        "dmg2": "1d10",
        "dmgType": "I",
        "property": [
            "EX",
            "H",
            "V",
            "IC"
        ],
        "source": "EW-BB5E",
		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
					"Liquid Form: This weapon is concealed in a tiny flask with a long neck to use as a handle. Upon opening the top of the flask a great mercurial blade errupts forth. You gain advanatge on checks to conceal this weapon in its unopened form",
					"Poison: This weapon innately deals poison damage."

                ]
            }
        ]
    },
    {
        "name": "Orc Double Axe",
        "type": "M",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 6000,
        "weight": 15,
        "dmg1": "1d8",
        "dmgType": "S",
        "property": [
            "EX",
            "H",
            "2H",
            "DBL"
        ],
        "source": "EW-BB5E",
		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
					"Double: When you take the Attack action and attack with a double weapon that you're holding, you can use a bonus action to attack again with the other part of the weapon. You don't add your ability modifier to the damage of the bonus attack, unless that modifier is negative."
                ]
            }
        ]
    },
    {
        "name": "Orc Shotput",
        "type": "R",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 4000,
        "weight": 55,
        "dmg1": "5d4",
        "dmgType": "B",
        "property": [
            "EX",
            "H",
            "T",
            "2H"
        ],
        "range": "10/40",
        "source": "EW-BB5E",
		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
					"Slave Taking: If you successfully attack with this weapon, the create takes {@dice 5d4} bludgeoning damage and gains the {@condition restrained} condition. A DC 18 (strength) check can remove the device.",
					"It is a full round action to successfully repack the OOrc Shotput before it may be used again."
                ]
            }
        ]
    },
    {
        "name": "Panther Claw",
        "type": "M",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 7500,
        "weight": 3,
        "dmg1": "1d4",
        "dmgType": "P",
        "property": [
            "EX",
            "L",
            "F",
            "S"
        ],
        "entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "Clawed Hand: When you attempt to disarm a target with an attack while holding this weapon, you have advantage on the attack."
                ]
            }
        ],
        "source": "EW-BB5E"
    },
    {
        "name": "Repeating Heavy Crossbow",
        "type": "R",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 40000,
        "weight": 12,
        "dmg1": "1d10",
        "dmgType": "P",
        "property": [
            "EX",
            "A",
            "H",
            "RLD",
            "2H"
        ],
        "range": "120/480",
        "reload": 5,
        "source": "EW-BB5E",
        "ammoType": "crossbow bolt|phb",
		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "Repeat Load: It is a free action to reload this crossbow"
                ]
            }
        ]
    },
    {
        "name": "Repeating Light Crossbow",
        "type": "R",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 25000,
        "weight": 6,
        "dmg1": "1d8",
        "dmgType": "P",
        "property": [
            "EX",
            "A",
            "RLD",
            "2H"
        ],
        "range": "80/320",
        "reload": 5,
        "source": "EW-BB5E",
        "ammoType": "crossbow bolt|phb",
		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
					"Repeat Load: It is a free action to reload this crossbow"
                ]
            }
        ]
    },
    {
        "name": "Sapara",
        "type": "M",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 1500,
        "weight": 6,
        "dmg1": "1d6",
        "dmgType": "S",
        "property": [
            "EX",
            "L",
            "F"
        ],
        "entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "Hooked: When you attempt to trip a target with an attack while holding this weapon, you have advantage on the attack."
                ]
            }
        ],
        "source": "EW-BB5E"
    },
    {
        "name": "Shuriken",
        "type": "R",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 100,
        "weight": 0.5,
        "dmg1": "1d2",
        "dmgType": "P",
        "property": [
            "EX",
            "A",
            "F",
            "T"
        ],
        "range": "10/40",
        "source": "EW-BB5E",
	"entries": [
		{
			"type": "entries",
			"name": "Special",
			"entries": [
				"Upon landing a successful attack this weapon inflicts 1 bleed stack.",
				"Bleeding: creatures that gain a stack of bleeding take 1d6 non-mitigatable slashing damage on the start of their turn. Beating DC 18 ends this condition. A DC 16 Wisdom (Medicine) check or magical healing will stop the bleeding.",
				"a creature can accrue multiple stacks of bleeding (max 6). Each time a stack is accrued the damage at the start of their turn is increased by one damage dice to a maximum of (6d6)."
		
			]
		}
	]
    },
    {
        "name": "Spiked Chain",
        "type": "M",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 5500,
        "weight": 10,
        "dmg1": "2d4",
        "dmgType": "P",
        "property": [
            "EX",
            "H",
            "2H"
        ],
        "source": "EW-BB5E",
		"entries": [
			{
				"type": "entries",
				"name": "Special",
				"entries": [
					"Upon landing a successful attack this weapon inflicts 1 bleed stack.",
					"Bleeding: creatures that gain a stack of bleeding take 1d6 non-mitigatable slashing damage on the start of their turn. Beating DC 18 ends this condition. A DC 16 Wisdom (Medicine) check or magical healing will stop the bleeding.",
					"a creature can accrue multiple stacks of bleeding (max 6). Each time a stack is accrued the damage at the start of their turn is increased by one damage dice to a maximum of (6d6)."
			
				]
			}
		]
	
    },
    {
        "name": "Spinning Javelin",
        "type": "R",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 20000,
        "weight": 2,
        "dmg1": "1d8",
        "dmgType": "P",
        "property": [
            "EX",
            "T",
            "S"
        ],
        "entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "Air Whif: You may use half your movement to wrap a spinning javelin with string and tie the string to your finger.",
                    "If you use a spinning javelin without wrapping the javelin with string and tying it to your finger, treat it as a normal {@item javelin|phb}.",
					"While wielding the spinning javelin, any attack directed at you involving a projectile has -2 to hit.",
                    "This weapon deals {@dice 1d8} piercing damage when used for a melee attack."
                ]
            }
        ],
        "range": "30/120",
        "source": "EW-BB5E"
    },
    {
        "name": "Spring-loaded Gauntlet",
        "type": "R",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 2000,
        "weight": 4,
        "dmg1": "1d4",
        "dmgType": "B",
        "property": [
            "EX",
            "L",
            "LD"
        ],
        "range": "10/15",
        "source": "EW-BB5E",
		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "Extendo fist: as an action you can make a ranged attack (up to 15 feet) with this weapon. "
                ]
            }
        ]
    },
    {
        "name": "Stump Knife",
        "type": "M",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 800,
        "weight": 2,
        "dmg1": "1d4",
        "dmgType": "P",
        "property": [
            "EX",
            "L",
            "F",
            "S"
        ],
        "entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "last line of defense: A stump knife can only be equipped to an arm which has had its hand amputated.",
                    "A stump knife cannot be disarmed."
                ]
            }
        ],
        "source": "EW-BB5E"
    },
    {
        "name": "Three-section-staff",
        "type": "M",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 4000,
        "weight": 8,
        "dmg1": "1d8",
        "dmgType": "B",
        "property": [
            "EX",
            "L",
            "F",
            "2H",
            "IC"
        ],
        "source": "EW-BB5E",
		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "breakdown: you have advantage on concealing this weapon"
                ]
            }
        ]
    },
    {
        "name": "Two-ball Bolas",
        "type": "R",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 500,
        "weight": 2,
        "dmg1": "1d4",
        "dmgType": "B",
        "property": [
            "EX",
            "T",
            "S"
        ],
        "entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "A Medium or smaller creature hit by a two-ball bolas must succeed a DC 13 Dexterity saving throw or be knocked {@condition prone} until it is freed. A two-ball bolas has no effect on creatures that are formless, or creatures that are Large or larger. When you use an action, bonus action, or reaction to attack with a bolas, you can make only one attack regardless of the number of attacks you can normally make."
                ]
            }
        ],
        "range": "10/40",
        "source": "EW-BB5E"
    },
    {
        "name": "Two-bladed Sword",
        "type": "M",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 10000,
        "weight": 10,
        "dmg1": "1d6",
        "dmgType": "S",
        "property": [
            "H",
            "2H",
            "DBL"
        ],
        "source": "EW-BB5E",
		"entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                   "arcing slash: When you make a melee weapon attack with an Two bladed sword, you may choose to target two creatures within your reach with a single attack. This attack uses the same attack roll for both targets and deals slashing damage equal to 1d6 plus your Strength modifier to each target."
                ]
            }
        ]
    },
    {
        "name": "Ward Cestus",
        "type": "M",
        "weapon": true,
        "weaponCategory": "simple",
        "rarity": "none",
        "value": 800,
        "weight": 4,
        "dmg1": "Special",
        "property": [
            "EX",
            "S"
        ],
        "entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "Attacks with this weapon are considered unarmed strikes.",
                    "Powerful punch: When you make an unarmed strike while holding this weapon, add double your Strength modifier to the damage roll."
                ]
            }
        ],
        "source": "EW-BB5E"
    },
    {
        "name": "Giant Slaying Sword",
        "type": "M",
        "weaponCategory": "martial",
        "weight": 250,
        "dmg1": "2d8",
        "dmgType": "S",
        "property": [
            "2H"
        ],
        "rarity": "Common",
        "value": 68000,
       "source": "BB5E",
        "entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries":[
            "It was too big to be called a sword. Massive, thick, heavy, and far too rough. Indeed, this weapons is a heap of sharpened raw iron. This weapon requires 20 Strength to wield and deals {@dice 2d8} damage when wielded.",
            "Rend: If you succesfully land an attack with this weapon you may continue to make subsequent attacks against creatures adjacent to you. Every creature you attack after the first gains a -5 penalty to the attack roll."
                ]
            }
       
        ]
    },
    {
        "name": "Small Explosive",
        "type": "R",
        "weapon": true,
        "weaponCategory": "simple",
        "weight": 2,
        "dmg1": "3d6",
        "dmgType": "F",
        "property": [
            "A"
        ],
        "range": "60/60",
        "rarity": "Common",
       "source": "BB5E",
        "value": 8000,
        "entries": [
            "This iron ball is filled with alchemical explosives and has a short fuse extending from it. As an action, a character can light and throw it at a point up to 60 feet away. Each character within 5 feet of that point must make a DC 12 dexterity saving throw, taking {@dice 3d6} fire damage on a failed save or half as much damage on a successful one. This item weighs 1 lb."
        ]
    },
    {
        "name": "Small Ice Explosive",
        "type": "R",
        "weapon": true,
        "weaponCategory": "simple",
        "weight": 2,
        "dmg1": "3d6",
        "dmgType": "C",
        "property": [
            "A"
        ],
        "range": "60/60",
        "rarity": "Common",
       "source": "BB5E",
        "value": 8000,
        "entries": [
            "This iron ball is filled with alchemical explosives and has a short fuse extending from it. As an action, a character can light and throw it at a point up to 60 feet away. Each character within 5 feet of that point must make a DC 12 dexterity saving throw, taking {@dice 3d6} cold damage on a failed save or half as much damage on a successful one. This item weighs 1 lb."
        ]
    },
    {
        "name": "Small Thunder Explosive",
        "type": "R",
        "weapon": true,
        "weaponCategory": "simple",
        "weight": 2,
        "dmg1": "3d6",
        "dmgType": "T",
        "property": [
            "A"
        ],
        "range": "60/60",
        "rarity": "Common",
       "source": "BB5E",
        "value": 8000,
        "entries": [
            "This iron ball is filled with alchemical explosives and has a short fuse extending from it. As an action, a character can light and throw it at a point up to 60 feet away. Each character within 5 feet of that point must make a DC 12 dexterity saving throw, taking {@dice 3d6} thunder damage on a failed save or half as much damage on a successful one. This item weighs 1 lb."
        ]
    },
    {
        "name": "Small Acid Explosive",
        "type": "R",
        "weapon": true,
        "weaponCategory": "simple",
        "weight": 2,
        "dmg1": "3d6",
        "dmgType": "A",
        "property": [
            "A"
        ],
        "range": "60/60",
        "rarity": "Common",
       "source": "BB5E",
        "value": 8000,
        "entries": [
            "This iron ball is filled with alchemical explosives and has a short fuse extending from it. As an action, a character can light and throw it at a point up to 60 feet away. Each character within 5 feet of that point must make a DC 12 dexterity saving throw, taking {@dice 3d6} acid damage on a failed save or half as much damage on a successful one. This item weighs 1 lb."
        ]
    },
    {
        "name": "Small Force Explosive",
        "type": "R",
        "weapon": true,
        "weaponCategory": "simple",
        "weight": 2,
        "dmg1": "3d6",
        "dmgType": "O",
        "property": [
            "A"
        ],
        "range": "60/60",
        "rarity": "Common",
       "source": "BB5E",
        "value": 8000,
        "entries": [
            "This iron ball is filled with alchemical explosives and has a short fuse extending from it. As an action, a character can light and throw it at a point up to 60 feet away. Each character within 5 feet of that point must make a DC 12 dexterity saving throw, taking {@dice 3d6} force damage on a failed save or half as much damage on a successful one. This item weighs 1 lb."
        ]
    },
	{
        "name": "Small Piercing Explosive",
        "type": "R",
        "weapon": true,
        "weaponCategory": "simple",
        "weight": 2,
        "dmg1": "3d6",
        "dmgType": "O",
        "property": [
            "A"
        ],
        "range": "60/60",
        "rarity": "Common",
       "source": "BB5E",
        "value": 8000,
        "entries": [
            "This iron ball is filled with alchemical explosives and has a short fuse extending from it. As an action, a character can light and throw it at a point up to 60 feet away. Each character within 5 feet of that point must make a DC 12 dexterity saving throw, taking {@dice 3d6} piercing damage on a failed save or half as much damage on a successful one. This item weighs 1 lb."
        ]
    },
	{
        "name": "Small Necrotic Explosive",
        "type": "R",
        "weapon": true,
        "weaponCategory": "simple",
        "weight": 2,
        "dmg1": "3d6",
        "dmgType": "N",
        "property": [
            "A"
        ],
        "range": "60/60",
        "rarity": "Common",
       "source": "BB5E",
        "value": 8000,
        "entries": [
            "This iron ball is filled with alchemical explosives and has a short fuse extending from it. As an action, a character can light and throw it at a point up to 60 feet away. Each character within 5 feet of that point must make a DC 12 dexterity saving throw, taking {@dice 3d6} necrotic damage on a failed save or half as much damage on a successful one. This item weighs 1 lb."
        ]
    },
	{
        "name": "Small Radiant Explosive",
        "type": "R",
        "weapon": true,
        "weaponCategory": "simple",
        "weight": 2,
        "dmg1": "3d6",
        "dmgType": "O",
        "property": [
            "A"
        ],
        "range": "60/60",
        "rarity": "Common",
       "source": "BB5E",
        "value": 8000,
        "entries": [
            "This iron ball is filled with alchemical explosives and has a short fuse extending from it. As an action, a character can light and throw it at a point up to 60 feet away. Each character within 5 feet of that point must make a DC 12 dexterity saving throw, taking {@dice 3d6} radiant damage on a failed save or half as much damage on a successful one. This item weighs 1 lb."
        ]
    },
    {
        "name": "Round Buckler",
        "type": "S",
        "weight": 3,
        "ac": 1,
        "rarity": "none",
        "value": 2000,
       "source": "BB5E",
        "entries": [
            "This small metal shield is held by a simple handle for ease of maneuvering. It increases your Armor Class by 1 (replacing the shield's normal bonus to AC) and you are proficient in its use if you are proficient with light armor. It also weighs half as much as a regular shield and can be donned or doffed without using an action."
        ]
    },
    {
        "name": "Dwarven Eagle Axe",
        "weapon": true,
        "type": "M",
        "weight": 30,
        "dmg1": "1d10",
        "dmg2": "1d12",
        "dmgType": "S",
        "property": [
            "V",
            "DWRF"
        ],
        "rarity": "uncommon",
        "value": 20000,
       "source": "BB5E",
        "entries": [
            "This mighty silver and gem-bladed weapon deals {@dice 1d10} slashing damage when wielded one handed and {@dice 1d12} slashing damage when wielded with two hands.",
			"this weapon may only be wielded by dwarves or those with training in dwarven weaponry.",
            "Eagle Cleave: When you take the Attack action while wielding a Dwarven Eagle Axe, you may make one additional attack as a bonus action, using the “opposite” head of the axe. You do not add your Strength modifier to the damage of this attack unless you have the Two-Weapon Fighting fighting style."
        ]
    },
    {
        "name": "Dwarven Titan Hammer",
        "weapon": true,
        "type": "M",
        "weight": 40,
        "dmg1": "1d12",
        "dmgType": "B",
        "property": [
            "2H",
            "DWRF"
        ],
        "rarity": "uncommon",
        "value": 50000,
       "source": "BB5E",
        "entries": [
            "This power hammer shaped like a might titan deals {@dice 1d12} damage when wielded.",
			"This weapon inflicts one stack of bleeding on a successful attack",
			"Bleeding: creatures that gain a stack of bleeding take 1d6 non-mitigatable slashing damage on the start of their turn. Beating DC 18 ends this condition. A DC 16 Wisdom (Medicine) check or magical healing will stop the bleeding.",
			"a creature can accrue multiple stacks of bleeding (max 6). Each time a stack is accrued the damage at the start of their turn is increased by one damage dice to a maximum of (6d6)."

        ]
    },
    {
        "name": "Dwarven Thorned Spear",
        "weapon": true,
        "type": "M",
        "weight": 22,
        "dmg1": "1d6",
        "dmgType": "B",
        "property": [
            "R",
            "DWRF"
        ],
        "rarity": "uncommon",
        "value": 10000,
       "source": "BB5E",
        "entries": [
            "This jagged heavy spear deals {@dice 1d6} damage",
			"this weapon may only be wielded by dwarves or those with training in dwarven weaponry.",
            "When you successfuly damage a living creature with this weapon on your turn, if they attempt to move away from your threatened range on their turn they take 1d6 piercing damage "
        ]
    },
    {
        "name": "Dwarven Sharp Throwing Hammer",
        "weapon": true,
        "type": "M",
        "weaponCategory": "simple",
        "weight": 3,
        "dmg1": "1d6",
        "dmgType": "S",
        "property": [
            "F",
            "L",
            "T",
            "DWRF"
        ],
        "range": "20/60",
        "rarity": "common",
        "value": 2000,
       "source": "BB5E",
        "entries": [
			"this weapon may only be wielded by dwarves or those with training in dwarven weaponry.",
            "This heavy small hammer, while commonly used for construction, makes for a great improvised throwing weapon. This weapon deals {@dice 1d6} slashing damage."
        ]
    },
    {
        "name": "Katana",
        "type": "M",
        "weapon": true,
        "weaponCategory": "martial",
        "weight": 3,
        "dmg1": "1d8",
        "dmg2": "1d10",
        "dmgType": "S",
        "property": [
            "V",
            "F"
        ],
        "rarity": "uncommon",
        "value": 65000,
       "source": "BB5E",
        "entries": [
            "This gently curved sword allows a properly trained wielder to make blindingly quick strikes.This weapon has the finesse property and deals {@dice 1d8} damage while wielded one handed and {@dice 1d10} while weilded in two hands.",
            "blade master: At the start of combat, you gain advantage on your first attack with this weapon."
        ]
    },
    {
        "name": "Ritual Scythe",
        "weapon": true,
        "type": "M",
        "weight": 11,
        "dmg1": "1d8",
        "dmgType": "S",
        "property": [
            "R",
            "2H"	
        ],
        "rarity": "Common",
        "value": 3000,
       "source": "BB5E",
        "entries": [
            "This common farming tool is a common weapon used by cultists and those who worship death. The Ritual Scythe deals {@dice 1d8} damage",
            "Drained Blade: Every time you kill a creature with the ritual scythe, your next successful attack deals an additional 1d8 necrotic damage."
        ]
    },
    {
        "name": "Gith Mind Blade",
        "weapon": true,
        "type": "M",
        "weight": 1,
        "dmg1": "1d4",
        "dmg2": "1d6",
        "dmgType": "Y",
        "property": [
            "V"	,
            "GITH"
        ],
        "rarity": "Uncommon",
        "value": 60000,
       "source": "BB5E",
        "entries": [
			"this weapon may only be wielded by Gith or those with training in Korasiam weaponry.",
            "This verstatile blade actually uses mental energy to create a sharp plasma based blade. THe Gith Mind blade deals {@dice 1d4} damage one handed and {@dice 1d6} two handed",
            "This weapon can be used as an arcane focus for the purposes of casting spells.",
			"Spells dealing psychic damage deal an additional damage die."
        ]
    },
    {
        "name": "Gith Mind Whip",
        "weapon": true,
        "type": "M",
        "weight": 11,
        "dmg1": "1d6",
        "dmgType": "Y",
        "property": [
            "V",
            "R",
            "GITH"
        ],
        "rarity": "Uncommon",
        "value": 50000,
       "source": "BB5E",
        "entries": [
			"this weapon may only be wielded by Gith or those with training in Korasiam weaponry.",
            "This peculiar verstatile whip uses mental energy to create a sharp plasma based blade. THe Gith Mind Whip deals {@dice 1d4} damage one handed and {@dice 1d6} two handed",
			"This weapon can be used as an arcane focus for the purposes of casting spells.",
			"Spells dealing psychic damage deal an additional damage die."
        ]
    },

    {
        "name": "Gith Astral 900 Pistol ",
        "type": "R",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 20000,
        "weight": 3,
        "range": "50/150",
        "dmg1": "1d6",
        "dmg2": "1d4",
        "dmgType": "P",
        "reload": 10,
        "property": [
            "FA",
            "A",
            "L"
        ],
       "source": "BB5E",

        "entries": [
            "Reload: 10",
            "this weapon may only be wielded by Gith or those with training in Korasiam weaponry.",
            "This strange block pistol has a 12 inch elongated barrell with purple crystaline streaks on each side, rectangular magazine, and pristine exact machining that makes it hard to differentiate between an artistic metal figure and a firearm with a break. This weapon deals {@dice 1d6} piercing damage and {@dice 1d4} Psychic damage.",
			"Quick Load: It is a Bonus action to reload this weapon with a premade Astral 900 Magazine."
        ]
    },




    {
        "name": "Tower Shield",
        "type": "S",
        "weight": 12,
        "ac": 3,
        "stealth": true,
        "rarity": "uncommon",
        "value": 25000,
        "source": "BB6E",
        "entries": [
            "This thick, unwieldy shield is large enough to cover you from ankle to shoulder. It increases your armor class by 3 (this replaces the shield's normal bonus to AC.) While this shield is equipped, you have disadvantage on Dexterity (Stealth) checks, and if your Strength score is lower than 15, your speed is reduced by 10 feet as if you were wearing heavy armor. It weighs twice as much as a regular shield."
            ," Shield Wall: As a action you may angle your shield become a haven against arrows. Your speed is reduced to zero and you gain +10 to your ac against ranged melee attacks."
        ]
    },
    {
        "name": "Dwarven Tower Shield",
        "type": "S",
        "weight": 100,
        "ac": 3,
        "stealth": true,
        "rarity": "Rare",
        "value": 150000,
       "source": "BB5E",
        "entries": [
            "This inhuman stone slab is enchanted with countless runes and is ordained with jewels and precious metals. It increases your armor class by 3 (this replaces the shield's normal bonus to AC.) While this shield is equipped, you have disadvantage on Dexterity (Stealth) checks, and if your Strength score is lower than 15, your speed is reduced by 10 feet as if you were wearing heavy armor.",
            "Mountain Wall: As an action you may slam your shield into the ground and 'lock down'. While in this stance the shield acts as a 5 ft. full cover wall (200 HP. 22 AC) and is resistant to all damage types. It takes an action to lift your shield out of the ground."
        
        ]
    },


    {
        "name": "Firearm Ammunition",
        "source": "BB5E",
        "type": "A",
        "rarity": "Common",
        "value": 100,
        "entries": [
            "These rounds are simplistic in nature and are invidiual pieces used for firearms."
        ]
       
    },

    
    {
        "name": "Empty Magazine",
        "source": "BB5E",
        "type": "A",
        "rarity": "Common",
        "value": 100,
        "entries": [
            "An empty magazine needing to be filled."
        ]
       
    },

    {
        "name": "Firearm Shell",
        "source": "BB5E",
        "type": "A",
        "rarity": "Common",
        "value": 100,
        "entries": [
            "These rounds are a more advanced types of ammunition. Bearings, slugs, or other projectiles loaded into shells with an ignition cap allow the projectiles to explode foreward."
        ]
       
    },
    {
        "name": "Harmonica Clip",
        "source": "BB5E",
        "type": "A",
        "rarity": "Common",
        "value": 100,
        "entries": [
            "Specialty clip used for a harmonica rifle. This device holds 6 rounds"
        ]
       
    },
    {
        "name": "Astral 900 Magazine",
        "source": "BB5E",
        "type": "A",
        "rarity": "Common",
        "value": 100,
        "entries": [
            "Specialty magazine used for a Astral. This device holds 10 rounds"
        ]
       
    },
    {
        "name": "Fuel Tank",
        "source": "BB5E",
        "type": "A",
        "weight": 15,
        "rarity": "Common",
        "value": 1000,
        "entries": [
            "Specialty Tank used for the flame thrower. Holds 5 units of fuel.",
            "Fuel tanks can be reloaded with 10 units of alchemical fire over a five minute time period to be reloaded."
        ]
       
    },



    {
        "name": "Alchemical Fire",
        "source": "BB5E",
        "type": "A",
        "Weight": 3,
        "rarity": "Common",
        "value": 100,
        "entries": [
            "A key component in explosives and ignition. ALchemical fire can come in many form such as powder, liquid, and gelatinous states."
        ]
       
    },





    {
        "name": "Cog Revolver",
        "type": "R",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 20000,
        "weight": 3,
        "range": "50/150",
        "dmg1": "1d8",
        "dmgType": "P",
        "reload": 4,
        "property": [
            "FA",
            "A",
            "L"
        ],
       "source": "BB5E",

        "entries": [
            "Reload: 4",
            "The most common and yet most deadly firearm, cog revolvers are staples of most modern armies.Cog revolvers use cartridge ammunition and do {@dice 1d8} piercing damage.",
			"Shell Loading:Firearms with the shell loading property require you to reload your gun by inserting each piece of ammunition in at a time. As a bonus action, you can reload three pieces of ammunition into the weapon on your turn. Alternatively, you can spend an action during your turn to reload every piece of ammunition into the gun at once. ",
			"Highnoon: As an action you may speed fire all the ammunition in the revolver. You may make separate attacks at creatures within range at disadvantage for every round fired. It takes half the rounds fired (rounded down) for the gun to cool down so it may be reloaded."
        ]
    },
    {
        "name": "Boomstick",
        
        "type": "R",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 35000,
        "weight": 3,
        "range": "10/15",
        "dmg1": "4d4",
        "dmgType": "P",
        "reload": 2,
        "property": [
            "FA",
            "A",
            "LD",
            "SP",
			"2H"
        ],
       "source": "BB5E",
        
         "entries": [
             "Reload: 2",
        "The short range but powerful boomstick is a common weapon of riflemen as it is able to unleash close range destruction. The boomstick does {@dice 4d4} piercing damage and consume two ammunition per shot.",
        "breakaction: As a bonus acction you may reload all ammunition in this weapon."								
		]
    },
    {
        "name": "Steam Rifle",
        "type": "R",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 45000,
        "weight": 3,
        "range": "60/120",
        "dmg1": "3d6",
        "dmgType": "P",
        "reload": 1,
        "property": [
            "FA",
            "A",
            "LD"				
        ],
       "source": "BB5E",
     "entries": [
         "Reload: 1",
        "A powerful long range weapon able to send destruction down range, steam rifles are common place amongst scouts. Steam rifles deal {@dice 3d6} piercing damage and use cartridge ammunition. It takes an action to reload the steam rifle",
		"Shell Loading:Firearms with the shell loading property require you to reload your gun by inserting each piece of ammunition in at a time. As a bonus action, you can reload three pieces of ammunition into the weapon on your turn. Alternatively, you can spend an action during your turn to reload every piece of ammunition into the gun at once. ",
		"Steady Shot: As an action you may crouch to steady your aim. Your movement speed is reduced to zero and you are treated as prone.  While in this state you gain an additonal +5 to all attack rolls made with the steam rifle. It is an action to stand up."								
        ]

    },
    {
        "name": "Harmonica Rifle",
        "type": "R",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 50000,
        "weight": 3,
        "range": "60/150",
        "dmg1": "2d4",
        "dmgType": "P",
        "reload": 6,
        "property": [
            "FA",
            "A",
            "LD"
        ],
       "source": "BB5E",
        "fluff": {
            "entries": [
                {
                    "type": "entries",
                    "entries": [
                        {
                            "type": "entries",
                            "entries": [
                                "Reload: 6",
                                "This peculiar weapon uses a harmonica like magazine to pass bullets into into the chamber.",
                                "Quick Load: It is a Bonus action to reload this weapon with a premade harmonica clip."

                            ]
                        }
                    ]
                }
            ]
        }
    },
	{
        "name": "Pepperbox",
        "type": "R",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 10000,
        "weight": 3,
        "range": "10/60",
        "dmg1": "1d4",
        "dmgType": "P",
        "reload": 3,
        "property": [
            "FA",
            "A",
            "L"
        ],
       "source": "BB5E",

        "entries": [
            "Reload: 3",
		"This strange four barreled box loads four shells at a time to be used. Inaccurate but wildly effective against multiple targets clumped together.",
        "Shell Loading:Firearms with the shell loading property require you to reload your gun by inserting each piece of ammunition in at a time. As a bonus action, you can reload three pieces of ammunition into the weapon on your turn. Alternatively, you can spend an action during your turn to reload every piece of ammunition into the gun at once. "

        ]
    },
	{
        "name": "Arquebus",
        "type": "R",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 35000,
        "weight": 3,
        "range": "50/150",
        "dmg1": "5d4",
        "dmgType": "P",
        "reload": 1,
        "property": [
            "FA",
            "A",
			"H"
        ],
       "source": "BB5E",
        "entries": [
            "Reload: 1",
		"Bulky: Firearms and ranged weapons with the bulky property have to be made stable in order to be fired effectively due to their weight and the damage they can put out with a single shot. You cannot attack more than once during your turn while wielding a bulky firearm.",
		"Shell Loading:Firearms with the shell loading property require you to reload your gun by inserting each piece of ammunition in at a time. As a bonus action, you can reload three pieces of ammunition into the weapon on your turn. Alternatively, you can spend an action during your turn to reload every piece of ammunition into the gun at once. ",
		"Firing Platform: as a bonus action you may stand the base of the arquebus into the ground. Your movement speed becomes zero and any attacks with the arquebus have advantage. It is a free action to abandon the arqebus and a full round action to restock the stand."
        ]
    },
	{
        "name": "Dragoon Revolver",
        "type": "R",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 25000,
        "weight": 3,
        "range": "60/150",
        "dmg1": "1d8",
		"dmg2": "1d4",
        "dmgType": "B",
        "reload": 6,
        "property": [
            "FA",
            "A",
            "LD",
			"L"
        ],
       "source": "BB5E",
        "entries": [
            "Reload: 6",
        "A tried and true firearm from the United Empires to the West, the Dragoon is a testament to engineering as it is capable of being used in any weather or battle condition. The dragoon deals {@dice 1d8} bludgeoning damage.",
		"Shell Loading:Firearms with the shell loading property require you to reload your gun by inserting each piece of ammunition in at a time. As a bonus action, you can reload three pieces of ammunition into the weapon on your turn. Alternatively, you can spend an action during your turn to reload every piece of ammunition into the gun at once. ",
		"Scatter: Firearms with the scatter property have two types of damage, a regular damage roll and a scatter damage roll. When you make an attack roll with one of these guns against a creature, compare your attack roll to the AC of all creatures within 5 feet of the target. If your attack would hit them, deal the firearm's scatter damage roll to the creatures. You do not add your ability score modifier to the damage of this attack, unless that modifier is negative."
        ]
    },
	{
        "name": "Flame Thrower",
        "type": "R",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 350000,
        "weight": 3,
        "range": "20/30",
        "dmg1": "3d4",
        "dmgType": "F",
        "reload": 6,
        "property": [
            "A",
			"2H",
			"H"
        ],
       "source": "BB5E",
        "entries": [
            "Reload: 5",
		"Bulky: Firearms and ranged weapons with the bulky property have to be made stable in order to be fired effectively due to their weight and the damage they can put out with a single shot. You cannot attack more than once during your turn while wielding a bulky firearm.",
		"Firestarter: You can make a normal single-target attack with a flamethrower using 1 unit of ammunition, or you can spray everything in a 5-foot-wide, 30-foot long line by dispensing 10 units of Ammunition. Each creature in the area must succeed on a Dexterity saving throw (DC 15) or take the flamethrower's normal damage. The flames of the flamethrower linger for six rounds and any creature who enters,starts, or ends the space of the flame takes the full damage of the flame thrower.",
		"This item requires a special backpack item called a 'Fuel Tank' to be used. It is a full round action to attach a fuel tank to the flamethrower. Fuel Tanks carry 5 units of ammunition."
        ]
    },
	{
        "name": "Burst Rifle",
        "type": "R",
        "weapon": true,
        "weaponCategory": "martial",
        "rarity": "none",
        "value": 155000,
        "weight": 3,
        "range": "20/80",
        "dmg1": "3d4",
		"dmg2": "2d4",
        "dmgType": "P",
        "reload": 6,
        "property": [
            "FA",
            "A",
            "LD"
        ],
       "source": "BB5E",
 
        "entries": [
            "Reload: 6",
        "Magazine Load: It is an action to reload this weapon with a premade Rifle clip.",
        "Burst Fire: Burst fire firearms are able to make a special attack that releases a stream of multiple bullets. As an action, you can force up to 3 creatures of your choice in a 15-foot square centered on a point within your gun's maximum range to make a Dexterity saving throw (DC 13), taking your gun's burst fire damage on a failed save, and half that damage on a success. This action subtracts rounds from your gun equal to the number of creatures affected, to a maximum of 3.",
		"Additionally, guns with the burst fire property always expend 3 rounds per attack.",
		"Burst Fire Save DC (Not Proficienct) = 12",
		"Burst Fire Save DC (Proficient) = 8 + Dexterity + Profiicency Bonus"

      ]
    },
    {
        "name": "Crow Quill",
        "type": "M",
        "weapon": true,
        "weaponCategory": "martial",
        "weight": 3,
        "dmg1": "1d4",
        "dmgType": "S",
        "property": [
            "V",
            "F",
            "BLD",
            "KK"
        ],
        "rarity": "uncommon",
        "value": 1500,
       "source": "BB5E",
        "entries": [
            "This strange combination of chained throwing knives and rope daggers seems to be obtuse to use but in the hands of a deadly kenku can have serious side effects for ones health.",
			"this weapon may only be wielded by Kenku or those with training in Goldwing Rookery weaponry.",
			"This weapon inflicts two stacks of bleeding on a successful attack",   
			"Bleeding: creatures that gain a stack of bleeding take 1d6 non-mitigatable slashing damage on the start of their turn. Beating DC 18 ends this condition. A DC 16 Wisdom (Medicine) check or magical healing will stop the bleeding.",
			"a creature can accrue multiple stacks of bleeding (max 6). Each time a stack is accrued the damage at the start of their turn is increased by one damage dice to a maximum of (6d6)."

        ]
    },
    {
        "name": "Talon Hook",
        "type": "M",
        "weapon": true,
        "weaponCategory": "martial",
        "weight": 3,
        "dmg1": "1d4",
        "dmgType": "O",
        "property": [
            "R",
            "2H",
            "BLD",
            "KK"
        ],
        "rarity": "uncommon",
        "value": 1500,
       "source": "BB5E",
        "entries": [
            "This strange club contains a hollowed interior able to produce astonisingly powerful wind gusts. Those hit by it have their skin rended open.",
			"this weapon may only be wielded by Kenku or those with training in Goldwing Rookery weaponry.",
			"This weapon inflicts two stacks of bleeding on a successful attack",   
			"Bleeding: creatures that gain a stack of bleeding take 1d6 non-mitigatable slashing damage on the start of their turn. Beating DC 18 ends this condition. A DC 16 Wisdom (Medicine) check or magical healing will stop the bleeding.",
			"a creature can accrue multiple stacks of bleeding (max 6). Each time a stack is accrued the damage at the start of their turn is increased by one damage dice to a maximum of (6d6)."
        ]
    },
    {
        "name": "Stone Armor",
       "source": "BB5E",
        "type": "HA",
        "rarity": "none",
        "weight": 100,
        "value": 300000,
        "ac": 16,
        "armor": true,
        "stealth": true,
        "entries": [
            "This finely crafted dwarven masterpiece is the peak of protection. If an attack were to be a critical hit against you, you take non-critical damage. This effect can only happens once per round of combat."
        ]
    },
    {
        "name": "Hunter's Armor",
       "source": "BB5E",
        "type": "HA",
        "rarity": "none",
        "weight": 45,
        "value": 100000,
        "ac": 16,
        "armor": true,
        "stealth": true,
        "strength": "13",
        "entries": [
            "Designed for Huntsmen going into combat, Hunter's Armor is able to absorb blows better than any other material. Once per day you can choose to negate all bludgeoning, piercing, and slashing damage taken during a turn. This ability must be used before a damage roll is calculated. "
        ]
    },
    {
        "name": "Void Armor",
       "source": "BB5E",
        "type": "HA",
        "rarity": "none",
        "weight": 65,
        "value": 1500000,
        "ac": 22,
        "armor": true,
        "stealth": true,
        "strength": "15",
        "entries": [
            "This terrifying armor made of pure void stone is nigh impervious to most standard atacks."
        ]
    },







    {
        "name": "Reinforced Plate Armor",
        "source": "BB5E",
        "page": 145,
        "srd": true,
        "basicRules": true,
        "type": "HA",
        "rarity": "none",
        "weight": 65,
        "value": 180000,
        "ac": 18,
        "strength": "15",
        "armor": true,
        "stealth": true,
        "entries": [
            "Plate consists of shaped, interlocking metal plates to cover the entire body. A suit of plate includes gauntlets, heavy leather boots, a visored helmet, and thick layers of padding underneath the armor. Buckles and straps distribute the weight over the body.",
            "This armor or shield has been reinforced at the joints and other weak points. While wearing it, critical damage you take from nonmagical attacks is reduced by 3."
        
        ]
    },
    {
        "name": "Absorbant Breastplate",
        "source": "BB5E",
        "page": 145,
        "srd": true,
        "basicRules": true,
        "type": "MA",
        "rarity": "none",
        "weight": 20,
        "value": 40000,
        "ac": 14,
        "armor": true,
        "entries": [
            "This armor consists of a fitted metal chest piece worn with supple leather. Although it leaves the legs and arms relatively unprotected, this armor provides good protection for the wearer's vital organs while leaving the wearer relatively unencumbered.",
            "The armor is padded with thick batting made from special absorbent fibers. This tends to wipe clean any sharp objects that penetrate it.",
            "The wearer of this armor has resistance to poison damage from poison-coated weapons, but not from the fangs of creatures that inject their venom as they bite."
      
      
        ]
    },
    {
        "name": "Half Plate Armor",
        "source": "BB5E",
        "page": 145,
        "srd": true,
        "basicRules": true,
        "type": "MA",
        "rarity": "none",
        "weight": 40,
        "value": 75000,
        "ac": 15,
        "armor": true,
        "stealth": true,
        "entries": [
            "Half plate consists of shaped metal plates that cover most of the wearer's body. It does not include leg protection beyond simple greaves that are attached with leather straps."
        ]
    },
    {
        "name": "Breathable Leather Armor",
        "source": "BB5E",
        "page": 144,
        "srd": true,
        "basicRules": true,
        "type": "LA",
        "rarity": "none",
        "weight": 10,
        "value": 1000,
        "ac": 11,
        "armor": true,
        "entries": [
            "The breastplate and shoulder protectors of this armor are made of leather that has been stiffened by being boiled in oil. The rest of the armor is made of softer and more flexible materials.",
            "While wearing this armor, you have advantage on saving throws you make against exhaustion effects due to extreme heat, as described in chapter 5 of the Dungeon Master's Guide."
        ]
    },
    {
        "name": "Chain Mail",
        "source": "BB5E",
        "page": 145,
        "srd": true,
        "basicRules": true,
        "type": "HA",
        "rarity": "none",
        "weight": 55,
        "value": 7500,
        "ac": 16,
        "strength": "13",
        "armor": true,
        "stealth": true,
        "entries": [
            "Made of interlocking metal rings, chain mail includes a layer of quilted fabric worn underneath the mail to prevent chafing and to cushion the impact of blows. The suit includes gauntlets."
        ]
    },
    {
        "name": "Chain Shirt",
        "source": "BB5E",
        "page": 144,
        "srd": true,
        "basicRules": true,
        "type": "MA",
        "rarity": "none",
        "weight": 20,
        "value": 5000,
        "ac": 13,
        "armor": true,
        "entries": [
            "Made of interlocking metal rings, a chain shirt is worn between layers of clothing or leather. This armor offers modest protection to the wearer's upper body and allows the sound of the rings rubbing against one another to be muffled by outer layers."
        ]
    },

    {
        "name": "Piercing Padded Armor",
        "source": "BB5E",
        "page": 144,
        "srd": true,
        "basicRules": true,
        "type": "LA",
        "rarity": "none",
        "weight": 8,
        "value": 7000,
        "ac": 11,
        "armor": true,
        "stealth": true,
        "entries": [
            "Padded armor consists of quilted layers of cloth and batting.",
            "While wearing this armor, all piercing damage is reduced by 3."
        ]
    },
    {
        "name": "Acidic Padded Armor",
        "source": "BB5E",
        "page": 144,
        "srd": true,
        "basicRules": true,
        "type": "LA",
        "rarity": "none",
        "weight": 8,
        "value": 7000,
        "ac": 11,
        "armor": true,
        "stealth": true,
        "entries": [
            "Padded armor consists of quilted layers of cloth and batting.",
            "While wearing this armor, all acid damage is reduced by 3."
        ]
    },
    {
        "name": "Soft Padded Armor",
        "source": "BB5E",
        "page": 144,
        "srd": true,
        "basicRules": true,
        "type": "LA",
        "rarity": "none",
        "weight": 8,
        "value": 7000,
        "ac": 11,
        "armor": true,
        "stealth": true,
        "entries": [
            "Padded armor consists of quilted layers of cloth and batting.",
            "While wearing this armor, all bludgeoning damage is reduced by 3."
        ]
    },
    {
        "name": "Quilted Padded Armor",
        "source": "BB5E",
        "page": 144,
        "srd": true,
        "basicRules": true,
        "type": "LA",
        "rarity": "none",
        "weight": 8,
        "value": 7000,
        "ac": 11,
        "armor": true,
        "stealth": true,
        "entries": [
            "Padded armor consists of quilted layers of cloth and batting.",
            "While wearing this armor, all slashing damage is reduced by 3."
        ]
    },
    {
        "name": "Heated Padded Armor",
        "source": "BB5E",
        "page": 144,
        "srd": true,
        "basicRules": true,
        "type": "LA",
        "rarity": "none",
        "weight": 8,
        "value": 7000,
        "ac": 11,
        "armor": true,
        "stealth": true,
        "entries": [
            "Padded armor consists of quilted layers of cloth and batting.",
            "While wearing this armor, all cold damage is reduced by 3."
        ]
    },
    {
        "name": "Iced Padded Armor",
        "source": "BB5E",
        "page": 144,
        "srd": true,
        "basicRules": true,
        "type": "LA",
        "rarity": "none",
        "weight": 8,
        "value": 7000,
        "ac": 11,
        "armor": true,
        "stealth": true,
        "entries": [
            "Padded armor consists of quilted layers of cloth and batting.",
            "While wearing this armor, all fire damage is reduced by 3."
        ]
    },
    {
        "name": "Rubber Padded Armor",
        "source": "BB5E",
        "page": 144,
        "srd": true,
        "basicRules": true,
        "type": "LA",
        "rarity": "none",
        "weight": 8,
        "value": 7000,
        "ac": 11,
        "armor": true,
        "stealth": true,
        "entries": [
            "Padded armor consists of quilted layers of cloth and batting.",
            "While wearing this armor, all lighting damage is reduced by 3."
        ]
    },
    {
        "name": "Sound Absorbant Padded Armor",
        "source": "BB5E",
        "page": 144,
        "srd": true,
        "basicRules": true,
        "type": "LA",
        "rarity": "none",
        "weight": 8,
        "value": 7000,
        "ac": 11,
        "armor": true,
        "stealth": true,
        "entries": [
            "Padded armor consists of quilted layers of cloth and batting.",
            "While wearing this armor, all thunder damage is reduced by 3."
        ]
    },
    {
        "name": "Lead Lined Padded Armor",
        "source": "BB5E",
        "page": 144,
        "srd": true,
        "basicRules": true,
        "type": "LA",
        "rarity": "none",
        "weight": 8,
        "value": 7000,
        "ac": 11,
        "armor": true,
        "stealth": true,
        "entries": [
            "Padded armor consists of quilted layers of cloth and batting.",
            "While wearing this armor, all radiant damage is reduced by 3."
        ]
    },
    {
        "name": "Poppy Milk Padded Armor",
        "source": "BB5E",
        "page": 144,
        "srd": true,
        "basicRules": true,
        "type": "LA",
        "rarity": "none",
        "weight": 8,
        "value": 7000,
        "ac": 11,
        "armor": true,
        "stealth": true,
        "entries": [
            "Padded armor consists of quilted layers of cloth and batting.",
            "While wearing this armor, all necrotic damage is reduced by 3."
        ]
    },






    {
        "name": "Camouflaged Scale Mail",
        "source": "BB5E",
        "page": 144,
        "srd": true,
        "basicRules": true,
        "type": "MA",
        "rarity": "none",
        "weight": 45,
        "value": 40000,
        "ac": 14,
        "armor": true,
        "stealth": true,
        "entries": [
            "This armor consists of a coat and leggings (and perhaps a separate skirt) of leather covered with overlapping pieces of metal, much like the scales of a fish. The suit includes gauntlets.",
            "You can take 1 hour to aquire natural foliage and materials to create a thin layering on this armor. If you do, you gain advantage on stealth rolls while in this specific type of terrain. If takes 1 hour to remove the thin camouflage layering."
        ]
    },
    {
        "name": "Spiked Armor",
        "source": "SCAG",
        "page": 121,
        "type": "MA",
        "rarity": "unknown",
        "weight": 45,
        "value": 8500,
        "ac": 14,
        "armor": true,
        "stealth": true,
        "entries": [
            "Spiked armor is a rare type of medium armor made by dwarves. It consists of a leather coat and leggings covered with spikes that are usually made of metal.",
            "When you use the attack action to grapple a creature, the target takes {@dice 1d3} piercing damage if your grapple check succeeds."

        ]
    },

    {
        "name": "Club",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 2,
        "value": 10,
        "weaponCategory": "simple",
        "property": [
            "L"
        ],
        "entries": [
           "blackjack: Make a single attack roll with your club against a humanoid target. If the attack hits, it does no damage, but the target must make a Constitution saving throw (DC 12) or be stunned until the beginning of its next turn." 
        ],
        "dmg1": "1d4",
        "dmgType": "B",
        "club": true,
        "weapon": true
    },
    {
        "name": "Dagger",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 1,
        "value": 200,
        "weaponCategory": "simple",
        "property": [
            "F",
            "L",
            "T"
        ],
        "entries":[
            "Concealed Blade: Instead of making a Dexterity (Stealth) check to hide yourself, you may make a Dexterity (Sleight of Hand) check—contested by an active or passive Wisdom (Perception) check—to conceal your dagger. As an action, you may make a weapon attack with a concealed dagger against a creature that has not yet acted in combat. This attack has advantage."
        ],
        "range": "20/60",
        "dmg1": "1d4",
        "dmgType": "P",
        "dagger": true,
        "weapon": true
    },
    {
        "name": "Flail",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "entries":[
            "Shield Snare: As an action while wielding a flail, you may make a single attack roll against a target carrying a shield or a similar defensive tool. This attack ignores any bonus to AC granted by the shield and deals normal weapon damage. If the attack hits, the target must also make a Strength saving throw (DC 12). On a failure, its shield is pulled from its grip and lands at its feet."
        ],
        "weight": 2,
        "value": 1000,
        "weaponCategory": "martial",
        "dmg1": "1d8",
        "dmgType": "B",
        "weapon": true
    },
    {
        "name": "Glaive",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 6,
        "value": 2000,
        "weaponCategory": "martial",
        "property": [
            "H",
            "R",
            "2H"
        ],
        "entries":[
            "Glaive: As an attack while you are wielding a glaive, you may sweep your opponent’s legs in an attempt to trip them. Make an attack roll against a Large or smaller creature. If the attack hits, it must succeed on a Strength saving throw (DC 12) or fall prone."
        ],
        "dmg1": "1d10",
        "dmgType": "S",
        "weapon": true
    },
    {
        "name": "Greataxe",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 7,
        "value": 3000,
        "weaponCategory": "martial",
        "property": [
            "H",
            "2H"
        ],
        "entries":[
           "Sundering Blow: As part of the attack action, make a single attack roll with your greataxe against a creature wielding a weapon, including natural weapons at disadvantage. If the attack hits, the weapon is damaged, and all attacks made with this weapon have disadvantage. Another sundering strike destroys the weapon. This attack has no effect on magical weapons, unless your nordmansch is also magical."
        ],
        "dmg1": "1d12",
        "dmgType": "S",
        "axe": true,
        "weapon": true
    },
    {
        "name": "Greatclub",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 10,
        "value": 20,
        "weaponCategory": "simple",
        "property": [
            "2H"
        ],
        "entries":[
            " SKull Basher: Make a single attack roll with your greatclub against a humanoid target. This attack does normal weapon damage and the target must make a Constitution saving throw (DC 12). On a failure, it is stunned until the beginning of its next turn. If the damage you dealt was greater than the creature’s maximum hit dice, it is stunned until the end of its next turn."
        ],
        "dmg1": "1d8",
        "dmgType": "B",
        "club": true,
        "weapon": true
    },
    {
        "name": "Greatsword",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 6,
        "value": 5000,
        "weaponCategory": "martial",
        "property": [
            "H",
            "2H"
        ],
        "entries":[
            "Arching Slice: When you attack with a greatsword, you may choose to target two creatures within your reach with a single attack. This attack uses the same attack roll for both targets and deals slashing damage equal to 1d6 plus your Strength modifier to each target."
        ],
        "dmg1": "2d6",
        "dmgType": "S",
        "sword": true,
        "weapon": true
    },
    {
        "name": "Halberd",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 6,
        "value": 2000,
        "weaponCategory": "martial",
        "property": [
            "H",
            "R",
            "2H"
        ],
        "entries":[
            "Rubuff: As an attack while you are wielding a halberd, you may use the haft of your weapon to rebuff up to two adjacent creatures. Make a single attack roll against one or two adjacent creatures within 5 feet of you. If the attack hits a target, you push it up to 10 feet away from you."
        ],
        "dmg1": "1d10",
        "dmgType": "S",
        "weapon": true
    },
    {
        "name": "Handaxe",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 2,
        "value": 500,
        "weaponCategory": "simple",
        "property": [
            "L",
            "T"
        ],
        "entries":[
            "Pinning Edge: When you make a melee or ranged weapon attack with a hand axe, you may attempt to pin a Large or smaller creature to a wall or surface by catching their clothing with the axe’s edge. This maneuver can be used against creatures without clothing at the GM’s discretion. Make an attack roll; if the attack hits, the target must make a Strength saving throw (DC 12). On a failure, the target’s speed is reduced to zero until the axe is removed. The target can make another Strength saving throw as an action on its turn."
        ],
        "range": "20/60",
        "dmg1": "1d6",
        "dmgType": "S",
        "axe": true,
        "weapon": true
    },
    {
        "name": "Javelin",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 2,
        "value": 50,
        "weaponCategory": "simple",
        "property": [
            "T"
        ],
        "entries":[
            "Javelin: As an attack, you may throw your javelin at a creature at the very limit of your range. Make an attack roll against a creature exactly 120 feet away. If the attack hits, the creature takes normal damage and must make a Wisdom saving throw. On a failure, the creature becomes frightened of you for 1 minute."
        ],
        "range": "30/120",
        "dmg1": "1d6",
        "dmgType": "P",
        "spear": true,
        "weapon": true
    },
    {
        "name": "Light Hammer",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 2,
        "value": 200,
        "weaponCategory": "simple",
        "property": [
            "L",
            "T"
        ],
        "entries":[
            "As an action, you may make a single ranged weapon attack with a light hammer. If the attack hits, the target must make a Constitution saving throw (DC 10) or be incapacitated until the end of its next turn."
        ],
        "range": "20/60",
        "dmg1": "1d4",
        "dmgType": "B",
        "hammer": true,
        "weapon": true
    },
    {
        "name": "Mace",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 4,
        "value": 500,
        "weaponCategory": "simple",
        "entries":[
            "Ribshatter: Make a single attack roll with your mace or morningstar against a humanoid target. This attack does normal weapon damage and the target must make a Constitution saving throw (DC 12). On a failure, it is stunned until the beginning of its next turn. If the damage you dealt was greater than the creature’s maximum hit dice, it is stunned until the end of its next turn."
        ],
        "dmg1": "1d6",
        "dmgType": "B",
        "mace": true,
        "weapon": true
    },
    {
        "name": "Quarterstaff",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 4,
        "value": 20,
        "weaponCategory": "simple",
        "property": [
            "V"
        ],
        "entries":[
            "Vault: You can use your quarterstaff to help you leap long distances. You can use an action to double the length of your long jump, allowing you to leap a number of feet up to twice your Strength score (this jump is part of your movement). If you land adjacent to a creature at the end of this jump, you can make a single attack with your quarterstaff as part of this action."
        ],
        "dmg1": "1d6",
        "dmgType": "B",
        "dmg2": "1d8",
        "weapon": true
    },
    {
        "name": "Sickle",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 2,
        "value": 100,
        "weaponCategory": "simple",
        "property": [
            "L"
        ],
        "entries":[
            "Bloody Cut: When you deal damage to a living creature with a Sickle, you may twist the blade as a bonus action. The creature must make a Constitution saving throw (DC 12) or take 2d4 slashing damage."
        ],
        "dmg1": "1d4",
        "dmgType": "S",
        "weapon": true
    },
    {
        "name": "Spear",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 3,
        "value": 100,
        "weaponCategory": "simple",
        "property": [
            "T",
            "V"
        ],
        "entries":[
            "Phalanx: If you are adjacent to at least two other spear-wielders, your spear attacks have advantage."
        ],
        "range": "20/60",
        "dmg1": "1d6",
        "dmgType": "P",
        "dmg2": "1d8",
        "spear": true,
        "weapon": true
    },
    {
        "name": "Battleaxe",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 4,
        "value": 1000,
        "weaponCategory": "martial",
        "property": [
            "V"
        ],
        "entries":[
            "Executioners Axe: If you move at least 20 feet straight toward a target, you can make a single attack with your Battleaxe as an action. If you hit, you deal damage as normal, and the target must make a Strength saving throw (DC 12) or fall prone."
        ],
        "dmg1": "1d8",
        "dmgType": "S",
        "dmg2": "1d10",
        "axe": true,
        "weapon": true
    },
    {
        "name": "Lance",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 6,
        "value": 1000,
        "weaponCategory": "martial",
        "property": [
            "R",
            "S"
        ],
        "dmg1": "1d12",
        "dmgType": "P",
        "weapon": true,
        "entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "You have disadvantage when you use a lance to attack a target within 5 feet of you. Also, a lance requires two hands to wield when you aren't mounted.",
                    "Charge: If you move at least 20 feet straight toward a creature before hitting it with a lance attack, the target takes an extra 1d12 piercing damage and must make a Strength saving throw. On a failure, the target falls prone."
                ]
            }
        ]
    },
    {
        "name": "Longsword",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 3,
        "value": 1500,
        "weaponCategory": "martial",
        "property": [
            "V"
        ],
        "entries":[
            "When a creature attacks you with a weapon, you may use your reaction to attempt to lock blades and parry their attack. Make an attack roll with your longsword. If the result of this roll equals or exceeds their attack roll, their attack misses."
        ],
        "dmg1": "1d8",
        "dmgType": "S",
        "dmg2": "1d10",
        "sword": true,
        "weapon": true
    },
    {
        "name": "Maul",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 10,
        "value": 1000,
        "weaponCategory": "martial",
        "property": [
            "H",
            "2H"
        ],
        "entries":[
            "As an action, you can make a single attack roll with your maul against a Medium or smaller target. If the attack hits, it does normal weapon damage, and the target must make a Strength saving throw (DC 14) . On a failure, the target is pushed up to 15 feet away from you."
        ],
        "dmg1": "2d6",
        "dmgType": "B",
        "hammer": true,
        "weapon": true
    },
    {
        "name": "Morningstar",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 4,
        "value": 1500,
        "weaponCategory": "martial",
        "entries":[
            "Ribshatter: Make a single attack roll with your mace or morningstar against a humanoid target. This attack does normal weapon damage and the target must make a Constitution saving throw (DC 12). On a failure, it is stunned until the beginning of its next turn. If the damage you dealt was greater than the creature’s maximum hit dice, it is stunned until the end of its next turn."
        ],
        "dmg1": "1d8",
        "dmgType": "P",
        "mace": true,
        "weapon": true
    },
    {
        "name": "Net",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "R",
        "rarity": "none",
        "weight": 3,
        "value": 100,
        "weaponCategory": "martial",
        "property": [
            "S",
            "T"
        ],
        "range": "5/15",
        "net": true,
        "weapon": true,
        "entries": [
            {
                "type": "entries",
                "name": "Special",
                "entries": [
                    "A Large or smaller creature hit by a net is {@condition restrained} until it is freed. A net has no effect on creatures that are formless, or creatures that are Huge or larger. A creature can use its action to make a DC 10 Strength check, freeing itself or another creature within its reach on a success. Dealing 5 slashing damage to the net (AC 10) also frees the creature without harming it, ending the effect and destroying the net. When you use an action, bonus action, or reaction to attack with a net, you can make only one attack regardless of the number of attacks you can normally make."
                ]
            }
        ]
    },
    {
        "name": "Pike",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 18,
        "value": 500,
        "weaponCategory": "martial",
        "property": [
            "H",
            "R",
            "2H"
        ],
        "entries":[
            "Phalanx: If you are adjacent to at least two other spear-wielders, your spear attacks have advantage."
        ],
        "dmg1": "1d10",
        "dmgType": "P",
        "weapon": true
    },
    {
        "name": "Scimitar",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 3,
        "value": 2500,
        "weaponCategory": "martial",
        "property": [
            "F",
            "L"
        ],
        "entries":[
            "Pommel Blow: As an attack, you may draw a sheathed one-handed sword and make an attack roll to strike the enemy with its pommel, leaving the target gasping for breath. This attack deals no damage, but the next attack roll made against the target has advantage. You must have at least one hand free to take this action."
        ],
        "dmg1": "1d6",
        "dmgType": "S",
        "sword": true,
        "weapon": true
    },
    {
        "name": "Shortsword",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 2,
        "value": 1000,
        "weaponCategory": "martial",
        "property": [
            "F",
            "L"
        ],
        "entries":[
            "Pommel Blow: As an attack, you may draw a sheathed one-handed sword and make an attack roll to strike the enemy with its pommel, leaving the target gasping for breath. This attack deals no damage, but the next attack roll made against the target has advantage. You must have at least one hand free to take this action."
        ],
        "dmg1": "1d6",
        "dmgType": "P",
        "sword": true,
        "weapon": true
    },
    {
        "name": "Trident",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 4,
        "value": 500,
        "weaponCategory": "martial",
        "property": [
            "T",
            "V"
        ],
        "entries":[
            "Snare: As an action, make an attack roll against a Medium creature you are grappling. If the attack hits, you catch one of the target’s limbs between the tines and bury the trident in the ground, restraining the creature until the weapon is dislodged. The target may make a Strength or Dexterity saving throw (their choice)(DC 13) at the end of each of their turns to escape."
        ],
        "range": "20/60",
        "dmg1": "1d6",
        "dmgType": "P",
        "dmg2": "1d8",
        "weapon": true
    },
    {
        "name": "War Pick",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 2,
        "value": 500,
        "weaponCategory": "martial",
        "entries":[
            "Pointed Blow: As an action, you may pinpoint a weak point of an opponent’s armor and make a single attack with your war pick against it. This attack pierces armor, treating the target’s AC as 10 + their Dexterity modifier + 2. On a hit, this attack does normal weapon damage."
        ],
        "dmg1": "1d8",
        "dmgType": "P",
        "weapon": true
    },
    {
        "name": "Warhammer",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 2,
        "value": 1500,
        "weaponCategory": "martial",
        "property": [
            "V"
        ],
        "entries":[
           "Sundering Strike: As an attack, make an attack roll with your warhammer against a creature wielding a weapon, including natural weapons. If the attack hits, the weapon is damaged, and all attacks made with this weapon have disadvantage. Another sundering strike destroys the weapon. This attack has no effect on magical weapons unless your warhammer is also magical."
        ],
        "dmg1": "1d8",
        "dmgType": "B",
        "dmg2": "1d10",
        "hammer": true,
        "weapon": true
    },
    {
        "name": "Whip",
        "source": "BB5E",
        "page": 149,
        "srd": true,
        "basicRules": true,
        "type": "M",
        "rarity": "none",
        "weight": 3,
        "value": 200,
        "weaponCategory": "martial",
        "property": [
            "F",
            "R"
        ],
        "entries":[
            "Bull Whip: As part of your attack action, make a whip attack against a beast or a creature with an Intelligence score of 2 or lower. The target must make a Wisdom saving throw (DC 12) or be frightened of you until the end of its next turn."
        ],
        "dmg1": "1d4",
        "dmgType": "S",
        "weapon": true
    },

    {
        "name": "Potion of Healing",
        "source": "BB5E",
        "page": 187,
        "srd": true,
        "otherSources": [
            {
                "source": "BB5E",
                "page": 153
            }
        ],
        "type": "P",
        "tier": "minor",
        "rarity": "common",
        "weight": 0.5,
        "value": 5000,
        "entries": [
            "You regain {@dice 2d4 + 2} hit points when you drink this potion. The potion's red liquid glimmers when agitated."
        ],
        "lootTables": [
            "Magic Item Table A"
        ]
    },

    {
        "name": "Potion of Greater Healing",
        "source": "BB5E",
        "page": 187,
        "value": 10000,
        "srd": true,
        "type": "P",
        "tier": "minor",
        "rarity": "uncommon",
        "entries": [
            "You regain {@dice 4d4 + 4} hit points when you drink this potion. The potion's red liquid glimmers when agitated."
        ],
        "lootTables": [
            "Magic Item Table A",
            "Magic Item Table B"
        ]
    },

    {
        "name": "Potion of Superior Healing",
        "source": "BB5E",
        "page": 187,
        "value": 15000,
        "srd": true,
        "type": "P",
        "tier": "minor",
        "rarity": "rare",
        "entries": [
            "You regain {@dice 8d4 + 8} hit points when you drink this potion. The potion's red liquid glimmers when agitated."
        ],
        "lootTables": [
            "Magic Item Table C"
        ]
    },
    {
        "name": "Potion of Supreme Healing",
        "source": "BB5E",
        "page": 187,
        "value": 20000,
        "srd": true,
        "type": "P",
        "tier": "minor",
        "rarity": "very rare",
        "entries": [
            "You regain {@dice 10d4 + 20} hit points when you drink this potion. The potion's red liquid glimmers when agitated."
        ],
        "lootTables": [
            "Magic Item Table D",
            "Magic Item Table E"
        ]
    },


    {
        "name": "Arcanaloth Venom",
        "source": "BB5E",
        "page": 258,
        "srd": true,
        "type": "G",
        "rarity": "none",
        "value": 15000,
        "poison": true,
        "entries": [
            "This poison must be harvested from a dead or incapacitated arcanoloth. A creature subjected to this poison must make a DC 14 Constitution saving throw, taking 10 {@dice 3d6} poison damage on a failed save, or half as much damage on a successful one."
        ],
        "poisonTypes": [
            "injury"
        ]
    },
    {
        "name": "Armor Oil",
        "type": "P",
        "source": "BB5E",
        "rarity": "Uncommon",
        "value": 10000,
        "entries": [
            "This thick, gleaming liquid contains enough to fully coat one set of armor. For 1 hour, the armor gives +1 AC"
        ]
    },
    {
        "name": "Comprehension Potion",
        "source": "BB5E",
        "rarity": "Uncommon",
        "value": 10000,
        "entries": [
            "This sparkling, bubbling clear liqid gives the drinker intelligence for one hour. The drinker gains proficiency with INT saving throws and all INT-based skills for 1 hour."
        ]
    },
    {
        "name": "Flexing Potion",
        "source": "BB5E",
        "rarity": "Uncommon",
        "value": 10000,
        "entries": [
            "This dark, heavy and brooding liquid gives the drinker strength for one hour. The drinker gains proficiency with STR saving throws and all STR-based skills for 1 hour."
        ]
    },
    {
        "name": "Dancing Potion",
        "source": "BB5E",
        "rarity": "Uncommon",
        "value": 10000,
        "entries": [
            "This whispy, oily and airy liquid gives the drinker dexterity for one hour. The drinker gains proficiency with DEX saving throws and all DEX-based skills for 1 hour."
        ]
    },
    {
        "name": "Librarians Potion",
        "source": "BB5E",
        "rarity": "Uncommon",
        "value": 10000,
        "entries": [
            "This stringent thick and lush liquid gives the drinker widsom for one hour. The drinker gains proficiency with WIS saving throws and all WIS-based skills for 1 hour."
        ]
    },
    {
        "name": "Speakers Potion",
        "source": "BB5E",
        "rarity": "uncommon",
        "value": 10000,
        "entries": [
            "This gleaming, and radiant liquid gives the drinker dexterity for one hour. The drinker gains proficiency with CHA saving throws and all CHA-based skills for 1 hour."
        ]
    },


    {
        "name": "Dragon Scale Potion",
        "source": "BB5E",
        "rarity": "rare",
        "value": 30000,
        "entries": [
            "This potion, similar in appearance to that of ancient dragon scales. The drinker gains thick scales offering a +2 bonus to their AC for one hour after drinking."
        ]
    },


    {
        "name": "Element Oil",
        "source": "BB5E",
        "rarity": "rare",
        "value": 30000,
        "entries": [
            "This small bottle of purplish oil contains enough liquid to coat one Medium size creature or one object no larger than 5 sq. ft. This creature or object is resistant to one type of damage for 1 hour. Roll 1d4. 1 - Fire, 2 - Cold, 3 - Radiant, 4 - Necrotic."
        ]
    },
    {
        "name": "Elixer of Awareness",
        "source": "BB5E",
        "rarity": "uncommon",
        "value": 10000,
        "entries": [
            "This persistently bubbling liquid is primarily clear, but flashes bright red periodically. For 2 hours after the drinker consumes the potion, they have a +5 bonus to their passive Perception and cannot be surprised."
        ]
    },
    {
        "name": "Elixer of Day",
        "source": "BB5E",
        "rarity": "rare",
        "value": 30000,
        "entries": [
            "The liquid in this potion seems to give off an internal light; the potion gives off dim light in a 5 ft. radius while still in its bottle. When it is consumed, the drinker begins to emit bright light in a 10 ft. radius and dim light for an additional 10 ft. They also become resistant to radiant damage. This effect lasts for 1 hour."
        ]
    },
    {
        "name": "Elixir of Living Death",
        "source": "BB5E",
        "rarity": "rare",
        "value": 30000,
        "entries": [
            "This pure black potion, appearing for all intents like a hole in space. When consumed as an action, the potion has the effects of the spell Feign Death for 1 hour. The drinker cannot be woken before the 1 hour has passed."
        ]
    },
    {
        "name": "Elixir of Night",
        "source": "BB5E",
        "rarity": "rare",
        "value": 30000,
        "entries": [
            "This potion is colored in shades of gray and black that never mix, getting darker towards the center of the bottle. The drinker gains 60 ft. darkvision and can see through magical darkness for 1 hour."
        ]
    },
    {
        "name": "Elixer of Peace",
        "source": "BB5E",
        "rarity": "uncommon",
        "value": 10000,
        "entries": [
            "This potion is light pink, with a perpetually fogged glass bottle. The drinker falls under the effect of the spell Calm Emotions: any effect causing them to be charmed or frightened is suppressed. This effect lasts for 10 minutes."
        ]
    },
    {
        "name": "Elixer of Satisfaction",
        "source": "BB5E",
        "rarity": "uncommon",
        "value": 10000,
        "entries": [
            "This dark green potion is brewed from the leaves of magically summoned Goodberries. One sip of the potion satisfies the thirst and hunger of the drinker for 1 day. The bottle contains enough liquid for 3 sips."
        ]
    },
    {
        "name": "Elixer of True Dreams",
        "source": "BB5E",
        "rarity": "uncommon",
        "value": 10000,
        "entries": [
            "This soft, swirling blue potion must be consumed before a long rest. The drinker will experience true dreams for the duration of their rest. Roll 1d100; there is a 20% chance that they forget the dreams upon waking."
        ]
    },
    {
        "name": "Energy Potion",
        "source": "BB5E",
        "rarity": "rare",
        "value": 30000,
        "entries": [
            "The bright blue liquid in this potion is shot through with moving bolts of bright yellow. The drinker gains 15 temporary hit points that last 1 hour. Once during that hour, they may also use an Action Surge and take one additional action on their turn beyond what they would normally be able to do."
        ]
    },
    {
        "name": "Elixir of Fey",
        "source": "BB5E",
        "rarity": "rare",
        "value": 30000,
        "entries": [
            "This potion appears clear at first glance, but gives off opalescent swirls of color when caught by the light. For 1 day, the drinker has advantage on saving throws against being charmed and cannot be put to sleep by magic. Any magical ability that detects different types of creatures will register the drinker as fey."
        ]
    },
    {
        "name": "Fog Breath Potion",
        "source": "BB5E",
        "rarity": "uncommon",
        "value": 10000,
        "entries": [
            "This potion resembles a smaller version of an Eversmoking Bottle. When consumed, the drinker begins to emit fog from their mouth, immediately emanating to a radius of 30 ft. For each round that they hold their mouth open, up to 1 minute, the fog spreads another 10 ft. The area of fog is heavily obscured. If the drinker attempts to close their mouth and hold in the fog, they must make a DC 13 Constitution saving throw or take 1d6 force damage."
        ]
    },
    {
        "name": "Glamour Potion",
        "source": "BB5E",
        "rarity": "very rare",
        "value": 40000,
        "entries": [
            "This clear liquid appears at first to be unassuming and plain, but then catches the eye, drawing attention when seen. The drinker gains proficiency with CHA saving throws and all CHA-based skills for 1 day."
        ]
    },
    {
        "name": "Judgement Potion",
        "source": "BB5E",
        "rarity": "very rare",
        "value": 40000,
        "entries": [
            "This clear potion appears completely still, but occasionally releases a bubble or two. The drinker gains proficiency with WIS saving throws and all WIS-based skills for 1 day."
        ]
    },
    {
        "name": "Mind Blast Potion",
        "source": "BB5E",
        "rarity": "rare",
        "value": 30000,
        "entries": [
           "This deep purple potion allows the drinker to emit psychic energy. When consumed, all creatures within a 30 ft. radius of the drinker must make a DC 13 INT saving throw or take {@dice 2d8} psychic damage. The drinker becomes resistant to psychic damage for 1 hour."
        ]
    },
    {
        "name": "Oil Accuracy",
        "source": "BB5E",
        "rarity": "rare",
        "value": 30000,
        "entries": [
           "This light brown oil is sufficient to coat one weapon or up to 5 pieces of ammunition. For 1 hour, attacks made with this weapon have a +2 bonus to hit."
        ]
    },
    {
        "name": "Potion of Rest",
        "source": "BB5E",
        "rarity": "very rare",
        "value": 40000,
        "entries": [
            "This red potion, which tastes sugary sweet and fizzes on the tongue, invigorates the drinker. The potion can take the place of one long rest. The drinker gains all the benefits of a long rest, including restoration of hit points and spell slots."
        ]
    },
    {
        "name": "Potion of Steel",
        "source": "BB5E",
        "rarity": "rare",
        "value": 30000,
        "entries": [
            "This steely gray potion grants the drinker 20 temporary hit points and gives them resistance to non-magical piercing, bludgeoning, and slashing damage. This effect lasts for 10 minutes."
        ]
    },
    {
        "name": "Potion of Shadows",
        "source": "BB5E",
        "rarity": "uncommon",
        "value": 10000,
        "entries": [
            "This potion is contained in a shadowed glass bottle, hiding the contents within. The drinker gains a +5 bonus to DEX (Stealth) checks they make for 1 hour."
        ]
    },
    {
        "name": "Potion of Song",
        "source": "BB5E",
        "rarity": "uncommon",
        "value": 10000,
        "entries": [
            "Opening the stopper of this potion reveals the faint notes of music emitted by the liquid within. When consumed, the drinker can sing a few notes, and all creatures within 30 ft. must make a DC 13 CHA saving throw against being charmed."
        ]
    },
    {
        "name": "Aboleth Oil",
        "source": "BB5E",
        "type": "G",
        "rarity": "very Rare",
        "value": 40000,
        "poison": true,
        "entries": [
            "A creature subjected to this oil must make a Constitution saving throw (DC 14) or become diseased. The disease has no effect for 1 minute and can be removed by any magic that cures disease, but the creature is unaware that they have been affected After 1 minute, the diseased creature's skin becomes translucent and slimy, the creature can't regain hit points unless it is underwater, and the disease can be removed only by Sea/ or another disease-curing spell of 6th level or higher. When the creature is outside a body of water, it takes 6 (1d12) acid damage every 10 minutes unless moisture is applied to the skin before 10 minutes have passed B c Ivv Pxs  (CONTACT)"
        ],
        "poisonTypes": [
            "injury"
        ]
    },
    {
        "name": "Radiant Oils",
        "source": "BB5E",
        "type": "G",
        "rarity": "rare",
        "value": 20000,
        "poison": true,
        "entries": [
            " An undead creature subjected to this poison must succeed on a Constitution saving throw (DC 16) or be poisoned for 1 minute, also taking 18 {@dice 4d8} radiant damage on a failed save, or half as much damage on a successful one. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."

        ],
        "poisonTypes": [
            "injury"
        ]
    },
    {
        "name": "Midnight Strike",
        "source": "BB5E",
        "type": "G",
        "rarity": "uncommon",
        "value": 10000,
        "poison": true,
        "entries": [
            "  A creature subjected to this poison suffers no effect until the stroke of midnight. If the poison has not been neutralized before then, the creature must succeed on a Constitution saving throw (DC 15), taking 31 (9d6) poison damage on a failed save, or half as much damage on a successful one."
        ],
        "poisonTypes": [
            "injury"
        ]
    },
    {
        "name": "Clarity Noose",
        "source": "BB5E",
        "type": "G",
        "rarity": "rare",
        "value": 20000,
        "poison": true,
        "entries": [
            "A creature subjected to this poison must make a Constitution saving throw (DC 10). On a failed save, it takes 6 (1d12) poison damage and is poisoned for 24 hours. On a successful save, the creature takes half damage and isn't poisoned"
        ],
        "poisonTypes": [
            "injury"
        ]
    }
],
"spell":[
    {
        "name": "Forge Fire",
        "source": "BB5EKT",
        "page": 144,
        "level": 1,
        "school": "T",
        "time": [
            {
                "number": 1,
                "unit": "minute"
            }
        ],
        "range": {
            "type": "point",
            "distance": {
                "type": "feet",
                "amount": 30
            }
        },
        "components": {
            "v": true,
            "s": true
        },
        "duration": [
            {
                "type": "timed",
                "duration": {
                    "type": "hour",
                    "amount": 8
                }
            }
        ],
        "entries": [

            "A Medium-sized fire within range, such as a campfire, burns with unnatural heat within its embers for the duration. It gives off intense heat, dealing twice as much damage to any creature that takes damage from it and consumes materials twice as fast as normal. For the duration, it can serve as a forge to smelt nonmagical metals, and counts as a forge for the purposes of blacksmithing."
        ],
        "classes": {
            "fromClassList": [
           
                {
                    "name": "Inventor",
                    "source": "KT"
                },
                {
                    "name": "Wizard",
                    "source": "PHB"
                }
            ]
        }
    },
    {
        "name": "Process Hide",
        "source": "BB5EKT",
        "page": 144,
        "level": 1,
        "school": "T",
        "time": [
            {
                "number": 1,
                "unit": "minute"
            }
        ],
        "range": {
            "type": "point",
            "distance": {
                "type": "touch"
            }
        },
        "components": {
            "v": true,
            "s": true,
            "m": "a hide which is consumed by the spell"
        },
        "duration": [
            {
                "type": "concentration",
                "duration": {
                    "type": "hour",
                    "amount": 1
                }
            }
        ],
        "entries": [
            "You work magic into a hide, turning it into processed leather. If you concentrate for the duration, you can turn a single hide into a rawhide leather, boiled leather, or tanned leather. Alternatively, you can turn hide scraps into leather scraps."

        ],
        "classes": {
            "fromClassList": [
           
                {
                    "name": "Inventor",
                    "source": "KT"
                },
                {
                    "name": "Wizard",
                    "source": "PHB"
                }
            ]
        }
    },
    {
        "name": "Change Material",
        "source": "BB5EKT",
        "page": 144,
        "level": 2,
        "school": "T",
        "time": [
            {
                "number": 2,
                "unit": "hour"
            }
        ],
        "range": {
            "type": "point",
            "distance": {
                "type": "touch"
            }
        },
        "components": {
            "v": true,
            "s": true,
            "m": "a common material used in the casting the spell which is consumed by the spell, turning into the new material"
        },
        "duration": [
            {
               "type": "instant"
                
            }
        ],
        "entries": [
            "You convert one common material into another material of equal or lesser mass and value."

        ],
        "entriesHigherLevel": [
            {
                "type": "entries",
                "name": "At Higher Levels",
                "entries": [
                    "When you cast this spell using a 4th- or 5th-level spell slot, you can convert a uncommon material the same way. When you cast this spell using a 6th- or 7th-level spell slot, you can convert a rare material the same way. When you cast this spell using an 8th- or 9th-level spell slot, you can convert a very rare material the same way."
                ]
            }
        ],
        "classes": {
            "fromClassList": [
           
                {
                    "name": "Inventor",
                    "source": "KT"
                },
                {
                    "name": "Wizard",
                    "source": "PHB"
                }
            ]
        }
    },
    {
        "name": "Conjure Tool",
        "source": "BB5EKT",
        "page": 144,
        "level": 2,
        "school": "C",
        "time": [
            {
                "number": 10,
                "unit": "minute"
            }
        ],
        "range": {
            "type": "point",
            "distance": {
                "type": "feet",
                "amount": 5
            }
        },
        "components": {
            "v": true,
            "s": true
            
        },
        "duration": [
            {
                "type": "timed",
                "duration": {
                    "type": "hour",
                    "amount": 1
                }
            }
        ],
        "entries": [
            "You conjure an artisan tool of your choice. It is magical in nature, but serves as a nonmagical version of that artisan tool for the duration."
        ],
        "classes": {
            "fromClassList": [
           
                {
                    "name": "Inventor",
                    "source": "KT"
                },
                {
                    "name": "Wizard",
                    "source": "PHB"
                }
            ]
        }
    },

    {
        "name": "Unseen Crafter",
        "source": "BB5EKT",
        "page": 144,
        "level": 5,
        "school": "C",
        "time": [
            {
                "number": 1,
                "unit": "minute"
            }
        ],
        "range": {
            "type": "point",
            "distance": {
                "type": "feet",
                "amount": 60
            }
        },
        "components": {
            "v": true,
            "s": true,
            "m": "a bit of string and of wood"
        },
        "duration": [
            {
                "type": "timed",
                "duration": {
                    "type": "hour",
                    "amount": 8
                }
            }
        ],
        "entries": [
            "This spell creates an invisible, mindless, shapeless, Medium force that performs simple tasks at your command until the spell ends. The crafter springs into existence in an unoccupied space on the ground within range. It has AC 10, 1 hit point, and a Strength of 2, and it can’t attack. If it drops to 0 hit points, the spell ends. ",
            "Once on each of your turns as a bonus action, you can mentally command the crafter to move up to 15 feet and interact with an object. The crafter can perform simple tasks that a human servant could do, such as fetching things, cleaning, mending, folding clothes, lighting fires, serving food, and pouring wine. Additionally, it can perform skilled crafting checks. It always uses the taking 10 rule for crafting checks, completing one check every 4 hours. Its crafting modifier is +5. When you summon it, you can summon it with one artisan tool of your choice, which only it can use. It can use any other artisan tools otherwise available. If you cast this spell again while the crafter still exists, the previous one vanishes. ",
            "Once you give the command, the servant performs the task to the best of its ability until it completes the task, then waits for your next command. If you command the servant to perform a task that would move it more than 60 feet away from you, the spell ends."
        ],
        "entriesHigherLevel": [
            {
                "type": "entries",
                "name": "At Higher Levels",
                "entries": [
                    "When you cast this spell using a spell slot of 6th level or higher, its crafting modifier increases by 1."
                ]
            }
        ],
        "classes": {
            "fromClassList": [
           
                {
                    "name": "Inventor",
                    "source": "KT"
                },
                {
                    "name": "Wizard",
                    "source": "PHB"
                }
            ]
        }
    },
    
    {
        "name": "Dimensional Toolbox",
        "source": "BB5EKT",
        "page": 145,
        "level": 3,
        "school": "C",
        "time": [
            {
                "number": 10,
                "unit": "minute"
            }
        ],
        "range": {
            "type": "point",
            "distance": {
                "type": "feet",
                "amount": 5
            }
        },
        "components": {
            "v": true,
            "s": true,
            "m": "a key worth 50 gp"
        },
        "duration": [
            {
                "type": "timed",
                "duration": {
                    "type": "hour",
                    "amount": 4
                }
            }
        ],
        "entries": [
           " You conjure an opening to a dimensional toolbox. This is stocked with every artisan tool and up to 10 gp worth of common materials. As an action, you can reach in and take out a tool or material contained within. Any tool or material that is not used when the spell ends fades away (materials used in crafting recipes remain)."

        ],
        "entriesHigherLevel": [
            {
                "type": "entries",
                "name": "At Higher Levels",
                "entries": [
                   " When you cast this spell using a spell slot of 5th level or higher, the toolbox contains +1 tools (tools that add +1 to the crafting check made). When you cast this spell using a spell slot of 9th level, the toolbox contains +2 tools (tools that add +2 to the crafting check made)."
                ]
            }
        ],
        "classes": {
            "fromClassList": [
           
                {
                    "name": "Inventor",
                    "source": "KT"
                },
                {
                    "name": "Wizard",
                    "source": "PHB"
                }
            ]
        }
    },

    {
        "name": "Dimensional Workshop",
        "source": "BB5EKT",
        "page": 145,
        "level": 6,
        "school": "C",
        "time": [
            {
                "number": 10,
                "unit": "minute"
            }
        ],
        "range": {
            "type": "point",
            "distance": {
                "type": "feet",
                "amount": 5
            }
        },
        "components": {
            "v": true,
            "s": true
        },
        "duration": [
            {
                "type": "timed",
                "duration": {
                    "type": "hour",
                    "amount": 4
                }
            }
        ],
        "entries": [
          "You conjure an extradimensional dwelling in range that lasts for the duration. You choose where its one entrance is located. The entrance shimmers faintly and is 5 feet wide and 10 feet tall. You and any creature you designate when you cast the spell can enter the extradimensional dwelling as long as the portal remains open. You can open or close the portal if you are within 30 feet of it. While closed, the portal is invisible.",
          "Beyond the portal is a magnificent foyer with numerous chambers beyond. The atmosphere is clean, fresh, and warm.",
          "You can create any floor plan you like, but the space can’t exceed 20 cubes, each cube being 10 feet on each side. The place is furnished with every artisan tool and typical crafting accessory you could need: anvils, furnaces, looms, etc. Furnishings and other objects created by this spell dissipate into smoke if removed from the workshop. When the spell ends, any creatures inside the extradimensional space are expelled into the open spaces nearest to the entrance."
        ],
        "entriesHigherLevel": [
            {
                "type": "entries",
                "name": "At Higher Levels",
                "entries": [
                    "When you cast this spell using a spell slot of 7th level or higher, the dwelling lasts for 24 hours."
                ]
            }
        ],
        "classes": {
            "fromClassList": [
           
                {
                    "name": "Inventor",
                    "source": "KT"
                },
                {
                    "name": "Wizard",
                    "source": "PHB"
                }
            ]
        }
    },

    {
        "name": "Gwynharwyf’s Passage",
        "source": "BB5EBSC",
        "page": 3,
        "level": 2,
        "school": "V",
        "time": [
            {
                "number": 1,
                "unit": "action"
            }
        ],
        "range": {
            "type": "cylinder",
            "distance": {
                "type": "feet",
                "amount": 20
            }
        },
        "components": {
            "v": true,
            "s": true
        },
        "duration": [
            {
                "type": "timed",
                "duration": {
                    "type": "minute",
                    "amount": 1
                },
                "concentration": true
            }
        ],
        "entries": [
            "A furious whirlwind of glittering sand spins around you in a 20-ft. radius and moves with you, remaining centered on you.There is a 10-ft. radius cylinder of unaffected space inside thewhirlwind. Creatures in the affected area treat it as difficultterrain and take {@damage 4d6} slashing damage when they enter the area or when they begin their turn there. The whirlwind grants you and those inside it +2 AC against ranged attacks. Creatures in the affected area become blinded while inside itand for 1 round thereafter. The whirlwind also hedges outvapor, gas, and fog."
        ],
        "entriesHigherLevel": [
            {
                "type": "entries",
                "name": "At Higher Levels",
                "entries": [
                    "When you cast this spell using a spell slotof 3rd or higher, the damage increases by {@damage 2d6} for each spellslot above 2nd."
                ]
            }
        ],
        "classes": {
            "fromClassList": [
                {
                    "name": "Warlock",
                    "source": "PHB"
                }
            ]
        }
    }
]
}
